{
    "table_name": "animate-dead",
    "notes": "Level: 3 -- Range: Touch -- Duration: Varies -- Casting time: 1 action -- Save: N/A",
    "general": "The cleric calls upon the power of his deity to animate the rotted flesh and aged bones of slain creatures, creating mindless minions to serve his will and vex his enemies. The number of un-dead and type created is determined by the spell check and the number and type of dead creatures available; i.e., a cleric can create skeletons from bare bones but needs a complete corpse to create a zombie. He cannot create more of either type than he has “raw materials” available regardless of the spell check (e.g., creating five skeletons when only three sets of bones are present). The un-dead remain animated and under the cleric’s control for an hour or more, depending on the spell check. When the spell duration ends, the un-dead collapse into the raw materials from which they were created. No cleric can control more than 4x his CL in Hit Dice of un-dead at any given time, but the cleric can “release” controlled un-dead to command other, possibly more powerful un-dead. Uncontrolled un-dead are likely to turn on their former master, however, so the cleric should be careful when releasing un-dead from his command. The player should reference the statistics of un-dead given later in this book for a sense of what can be created with this spell, but these should serve as guidelines not limitations. The typical humanoid corpse will produce a 1 HD skeleton or a 3 HD zombie. But there are more powerful skeletons to be created by using the bones of a giant. This work includes stats for the following un-dead, and of course a creative cleric may animate additional types of his own design: ghost (page 413), ghoul (page 416), mummy (page 422), shadow (page 425), skeleton (page 426), and zombie (page 431)",
    "sub_tables": [
      {
        "subtable_name": "Manifestation",
        "dice_size": "1d4",
        "table": {
          "1": "The air fills with the stench of corruption as the dead rise at the cleric’s touch.",
          "2": "A dark, swirling energy rises around the target before the un-dead emerge.",
          "3": "A necrotic aura pulses from the cleric’s hands as the dead are reanimated.",
          "4": "A brief flash of pale blue light occurs as the bodies stir to life."
        }
      },
      {
        "subtable_name": "Spell Results",
        "dice_size": "1d20",
        "table": {
          "1-15": "Failure.",
          "16": "The cleric creates a single skeleton of up to 1 HD, provided the necessary raw materials are present. The skeleton remains animated for a full day.",
          "17": "The cleric creates a single zombie or skeleton of up to 3 HD, provided the necessary raw materials are present. The un-dead remains animated for a full day.",
          "18-21": "The cleric creates a number of skeletons or zombies (one or the other) equal to his CL in Hit Dice. For example, a level 5 cleric could create five skeletons (5 HD) or a single zombie (3 HD). If multiple corpses are available, the cleric must choose which type of un-dead he is creating; he cannot animate both skeletons and zombies with a single casting of the spell. Excess Hit Dice have no effect if they exceed the number of available corpses. The un-dead remain animated for a full week.",
          "22-23": "The cleric creates a number of skeletons or zombies equal to 2x his CL in Hit Dice. For example, a level 5 cleric could create 10 skeletons (10 HD) or 3 zombies (9 HD). If multiple corpses are available, the cleric must choose which type of un-dead he is creating; he cannot animate both skeletons and zombies with a single casting of the spell. Excess Hit Dice have no effect if they exceed the number of available corpses. The un-dead remain animated for a full month.",
          "24-26": "The cleric creates a number of skeletons or zombies equal to 2x his CL in Hit Dice. For example, a level 5 cleric could create 10 skeletons (10 HD) or 3 zombies (9 HD). If multiple types are available, the cleric can produce a mixture of un-dead provided their combined Hit Dice do not exceed 2x his CL or the number of available corpses. The un-dead remain animated for a full month.",
          "27-31": "The cleric creates a number of more formidable skeletons and zombies equal to 3x his CL in Hit Dice. He can choose to animate the mortal remains of larger creatures, creating skeletons and zombies with above-average HD. For example, a 5th level cleric could animate the skeletal remains of a giant lizard (3 HD) to create a 3 HD skeleton, or revivify a dead ogre (4 HD) to make a 4 HD zombie. He cannot animate a single creature with more Hit Dice in life than 2x his CL. If multiple corpses are available, the cleric can produce a mixture of un-dead provided their combined HD do not exceed his CL or the number of available corpses. These advanced un-dead retain none of their special abilities or movement means they possessed in life (no flight, breath weapons, etc.). The un-dead remain animated for a full year.",
          "32-33": "The cleric creates a number of un-dead equal to 3x his CL in Hit Dice. He may create any sort of unintelligent un-dead, provided the raw materials are available. This includes mummies, ghouls, ghosts, shadows, and other creatures, but excludes liches and vampires. He can also choose to animate the mortal remains of larger creatures, creating skeletons and zombies with above-average HD. For example, a 5th level cleric could animate the skeletal remains of a giant lizard (3 HD) to create a 3 HD skeleton, or revivify a dead ogre (4 HD) to make a 4 HD zombie. He cannot animate a single creature with more Hit Dice in life than 3x the cleric’s CL. If multiple corpses are available, the cleric can produce a mixture of un-dead provided their combined Hit Dice do not exceed three times his CL or the number of available corpses. Excess Hit Dice have no effect if they exceed the number of available corpses. The un-dead remain animated for a full year.",
          "34-35": "The cleric creates a number of un-dead equal to 4x his CL in Hit Dice. He may create any sort of unintelligent un-dead, provided the raw materials are available. This includes mummies, ghouls, ghosts, shadows, and other creatures, but excludes liches and vampires. He can also choose to animate the mortal remains of larger creatures, creating skeletons and zombies with above-average HD. For example, a 5th level cleric could animate the skeletal remains of a troll (8 HD) to create an 8 HD skeleton or revivify a dead dragon (15 HD) to make a 15 HD zombie. He cannot animate a single creature with more Hit Dice in life than 3x the cleric’s CL. These advanced un-dead retain none of their special abilities or movement means they possessed in life (no flight, breath weapons, etc.). The un-dead remain animated permanently until killed or released from control.",
          "36+": "The cleric creates terrifying un-dead. He can animate any kind of un-dead, including intelligent undead such as liches and vampires, provided the raw materials are present and the correct rituals are performed. The created undead can be up to 4x his CL in Hit Dice. He can choose to animate the mortal remains of larger creatures, creating skeletons and zombies with above-average HD. If multiple corpse types are available, the cleric can produce a mixture of un-dead provided their combined Hit Dice do not exceed 4x his CL or the number of available corpses. In addition to their normal un-dead abilities and resistances, these animated dead can have strange traits. The character can pre-determine these traits with sufficient research, materials, and preparation, or the judge can roll to determine them randomly (e.g., refer to the table of special properties tables for skeletons on page 427). Animated dead of this type also retain special movement means at the judge’s discretion. For example, a zombie dragon could still fly on rotting wings, but a skeletal one lacking wing membranes could not. The un-dead remain animated permanently until killed or released from control."
        }
      }
    ]
  }
  