{
    "table_name": "arcane-affinity",
    "notes": "Level: 2 Range: Self Duration: Varies Casting time: Varies Save: N/A",
    "general": "Some wizards choose to specialize in a particular kind of magic. They may be necromancers who study the lore of un-dead or pyromancers who control fire. They may be elementalists who can control freewilled elementals or summoners who bring material objects into existence from nowhere. These specialist mages go beyond the capabilities of normal magic-users by studying, pondering, and ultimately completely connecting to the school of arcane magic they choose. A necromancer may live with un-dead creatures to fully understand them. A pyromancer may dwell in a volcano. An elementalist may live on one of the four elemental planes, and a conjurer may study the atomic building blocks of matter. This spell is the mechanism by which specialty magic happens. This spell forms an affinity between the caster and one kind of magic. This affinity comes after much time and labor is expended and has a cost: the spell slot is forever occupied by this very spell, and the caster is forever connected to the arcane element he chooses. However, this spell also has a benefit: it makes the caster more powerful in a specific school of magic. Although this spell is listed in the caster’s spellbook as the spell arcane affinity, it is really a different spell depending on each caster’s goal. It truly represents the time and effort necessary to develop an affinity for a particular school of magic. The “casting time” is a set of rituals and actions necessary to form the affinity. This is a level 2 spell because a caster must understand the basic principles of magic before he can build an affinity. Traditional affinities and their “casting time” are as follows. Note the “casting time” can, in game terms, be considered to overlap with adventuring time or be a lull between adventures. • Illusionist: A specialist in spells that alter perceptions or create false images and sounds. An illusionist must spend at least one year understanding how the human body processes sensory input and how it can be fooled.• Summoner: A specialist in spells that summon animals, monsters, and other creatures to aid the caster, including elementals and demons. A summoner may further specialize in a particular kind of creatures summoned (e.g., elementals). Summoners may also specialize in summoning objects as well as creatures. A summoner must spend at least one year studying the creatures he wants to summon, both in captivity and in their natural surroundings. • Necromancer: A specialist in the un-dead, their creation, their control, and their limits. A necromancer may ultimately pursue eternal life via his own transformation into an un-dead. A necromancer must spend at least one year in the presence of un-dead. • Transmuter: A specialist in changing matter from one form to another, whether it be flesh to stone, iron to gold, or something in between. A transmuter must spend at least one year in a laboratory studying the properties of different materials. • Pyromancer: A specialist in the study of fire. Pyromancers must spend at least one year in the presence of great flames, such as an active volcano or on the plane of fire. Pyromancers ultimately learn to create, control, and destroy flames at will. There are other specialists who study similar magical powers but control other elements; e.g., fulminators who study electricity, cryomancers who study cold, and aerialists who study air. • Demonologist: A specialist in the summoning, control, exorcism, destruction, and lore of demons. This is a dangerous specialty, for demons are never willing to divulge the information necessary to control them. A demonologist must spend at least three years studying ancient tomes, consulting supernatural spirits, and traveling to distant planes to learn what he needs to control demons. After a specialist has committed the necessary “casting time” to specialize in one field, a spell check is made. The spell check determines the benefit of specialization, as noted below. Many specialists utilize spellburn at this point to ensure a good result. Some specialists may attempt ritualized versions of this spell by casting it in a place of power, in concert with other mages, or with an appropriate sacrifice. The ritual rules at the beginning of this chapter, combined with the judge’s discretion, determine the nature of the ritual. The caster may choose to specialize in more than one field, provided he obeys the dictates given here and in the spell results. Because specialization typically results in improved spellcasting in certain spells and reduced spellcasting in others, a wizard with multiple specialties may find they begin to offset each other.",
    "sub_tables": [
      {
        "subtable_name": "Manifestation",
        "dice_size": "1d1",
        "table": {
          "1": "Varies"
        }
      },
      {
        "subtable_name": "Corruption",
        "dice_size": "1d1",
        "table": {
          "1-4": "Roll 1d4 according to specialty: Illusionist: (1) at every full moon, caster’s face assumes the appearance of a randomly determined other humanoid; (2) all illusions created by the caster have an appearance of sadness or failure, and he is unable to create scenes of joy or happiness; (3) caster’s form assumes an illusory appearance any time any die roll comes up on a natural 13 (roll % on the wizard table in Appendix L to randomly determine the nature of the illusion, treating the language as corresponding to its normal creature type; i.e., a result of “eagle” means the caster resembles an eagle); (4) each morning, roll 1d7, and on a 7, random illusions flicker into existence around the caster all day long, potentially ruining business deals and terrifying peasants around him; Summoner/elementalist: (1) caster inadvertently summons an aggravated mundane animal (or, if an elementalist, an elemental) any time any die roll comes up on a natural 13, such that the animal appears somewhere within 50’ and immediately attacks the nearest creature out of confusion or rage; (2) the caster’s appearance takes on traits of the last creature he summoned before casting this spell; (3) the caster always annoys his summoned creatures through some difficultto-identify aspect of his spellcasting, so his summoned creatures are always hostile when they appear; (4) the caster himself is summoned to do the bidding of a greater power and disappears for 1d7 days; he reappears ragged and exhausted with 1d4 randomly determined diseases; Necromancer: (1) caster’s head takes on the aspects of a skull: all fat disappears, skin pulls tight, nose pulls back to slits, hair falls out in tattered clumps, ears rot; (2) caster’s eyes turn pitch-black; (3) caster stinks of the grave; (4) caster’s flesh putrefies and melts, giving him a horrible appearance; Transmuter: (1) forevermore, any gold touched by the caster turns to iron; (2) whenever the player rolls a 13 on any dice roll, all metals within 20’ change into another randomly determined metal, always of lesser value, such that treasure is always downgraded one notch (gold -> silver, silver -> copper, etc.) and weapons become less effective, giving them a -1 damage penalty as they become softer; (3) the caster’s face is transmuted into a randomly determined metal, giving him a strange unearthly appearance; (4) the caster’s left hand is changed intowood; Pyromancer/fulminator/cryomancer/ aerialist: (1) caster’s eyes change to resemble the appropriate substance (i.e., fire, electricity, ice, or air); (2) caster radiates aura of heat, static electricity, cold, or wind, as the case may be, which all creatures within 20’ can’t help but notice; (3) caster spontaneously summons painful burst of appropriate energy type (flame, electricity, cold, or sharp wind) on any die roll that comes up a natural 13, inflicting 1 point of damage to himself and one randomly determined creature within 20’; (4) caster’s face permanently changes to appear as if he had excessive exposure to the appropriate element; Demonologist: (1) caster’s teeth, jagged eyebrows, and snake-like pupils; (2) caster’s tongue is slit like a snake’s; (3) caster gains cloven hooves in place of his feet; (4) caster’s true name is learned by a demon, and each day there is a 1% chance the demon will use it to force him to perform some nefarious deed."
        }
      },
      {
        "subtable_name": "Misfire",
        "dice_size": "1d1",
        "table": {
          "1": "N/A"
        }
      },
      {
        "subtable_name": "Spell Results",
        "dice_size": "1d20",
        "table": {
          "1": "The affinity fails and the caster automatically suffers corruption. The caster does not gain any particular insight orknowledge from his study and expenditure of arcane energy. The caster may not attempt another spell check without expending half again as much time in study (e.g., if he spent one year getting to this point, he must now spend another six months)",
          "2-13": "The affinity fails. The caster does not gain any particular insight or knowledge from his study and expenditure of arcane energy. The caster may not attempt another spell check without expending half again as much time in study (e.g., if he spent one year getting to this point, he must now spend another six months).",
          "12-13": "The caster creates a simple visual effect at a distance of up to 20’ per caster level. For example, a flash of light, dancing lights, a ray of moonlight, or a patch of darkness.",
          "14-15": "The caster establishes a nominal affinity with the school of magic he is studying. He may select one spell he already knows, which must be thematically associated with the school of magic. (For example, a pyromancer may select fireball.) Forevermore, the caster casts that spell with an improved die on his spell checks, based on the dice chain. However, the caster’s great devotion means he was unable to practice other magics to the same extent as those in his chosen school. The caster must select one other spell he knows, which cannot be arcane affinity. Spell checks on the affected spell are automatically reduced by one die on the dice chain",
          "16-19": "The caster establishes a strong affinity with the school of magic he studies. He may select two spells he already knows, which must be thematically associated with the school of magic. (For example, a pyromancer may select fireball and fire resistance.) Forevermore, the caster casts those spells with an improved die on his spell checks, based on the dice chain. However, the caster’s great devotion means he was unable to practice other magics to the same extent as those in his chosen school. The caster must select one other spell he knows, which cannot be arcane affinity. Spell checks on the affected spell are automatically reduced by one die on the dice chain.",
          "20-21": "The caster establishes a powerful affinity with the school of magic he studies. He may learn one new spell from that school of magic that he did not know before. This spell is a bonus spell and does not count toward his normal spell slots. It is cast with a normal d20 spell check die. For example, a pyromancer who knows fireball and fire resistance, but not scorching ray, may select scorching ray as his spell. However, his knowledge of this spell comes at great cost. The caster permanently loses 1 hit point to reflect the physical duress required to expand his grasp of magic.",
          "22-25": "The caster gains a true understanding of the school of magic he studies. He may learn one new spell fromthat school of magic that he did not know before at the cost of 1 hit point, as result 20-21 above. Additionally, he may select two spells that he already knows and increase his spell check die at the cost of reducing the die on one other spell check result, as result 16-19 above.",
          "26-29": "The caster is a master of his specialty. He may select three spells thematically associated with the school of magic, which he forevermore casts at a higher spell check die (as result 16-19 above). If he so chooses, he may “hold” his selection of one, two, or all of these spells until he levels up. At any point in the future, when he gains a level, he may assign the higher spell check die to one spell he now knows. Once assigned,the spell check die cannot be changed, but the caster can “hold” his selection indefinitely. The caster must select two other spells he knows, neither of which can be arcane affinity, which are automatically reduced in spell check die by one progression (typically from 1d20 to 1d16). Finally, the caster permanently loses 1 hit point to reflect the physical strain of this process.",
          "30+" : "The caster is a grand master of his specialty. He may select three spells to cast at a higher spell check die, as 26- 29 above, but at a cost of only one other spell at a lower die. Additionally, he receives one free spell slot associated with his specialty at a cost of 1 hit point, as result 22-25 above."
        }
      }
    ]
  }
  