{
    "table_name": "cause-earthquake",
    "notes": "Level: 4 -- Range: Various -- Duration: 1 round -- Casting time: 1 action -- Save: See below",
    "general": "The cleric creates an intense but centralized earth tremor, causing destruction in his immediate vicinity. The shockwave upsets creatures, knocks down structures, causes crevasses to open in the earth, and creates avalanches and landslides.",
    "sub_tables": [
      {
        "subtable_name": "Manifestation",
        "dice_size": "1d4",
        "table": {
          "1": "The earth begins to heave and toss when the cleric slaps the ground at his feet.",
          "2": "Coils of divine light streak down from on high or burst from the ground, wrapping themselves around the targets.",
          "3": "Rays of energy shine from the cleric’s holy symbol and touch each affected target in turn.",
          "4": "Ghostly figures coalesce around the targets, touching their faces with insubstantial hands."
        }
      },
      {
        "subtable_name": "Spell Results",
        "dice_size": "1d20",
        "table": {
          "1-17": "Failure.",
          "18-19": "The ground rumbles and heaves in a 40’ radius area centered at a point up to 100’ away from the cleric. All creatures standing in the area of effect must make a Ref save to remain standing. This is the only action allowable during the round; no attacks or spell casting is possible as the affected targets struggle to remain standing. Creatures in the area of effect suffer a -2 penalty to AC as they lose their defensive stance, and spellcasters concentrating on active spells must make a DC 11 Will save to maintain their castings. Flying and incorporeal creatures are obviously unaffected by the spell.",
          "20-23": "The ground quakes in a 60’ radius area centered at a point up to 150’ away from the cleric. All creatures standing in the area of effect must make a Ref save to remain standing; those who fail take 1d3 damage from a hard fall. Standing is the only action allowable during the round; no attacks or spellcasting is possible as the affected targets struggle to remain standing. Creatures in the area of effect suffer a -4 penalty to AC as they lose their defensive stance, and spellcasters concentrating on active spells must make a DC 13 Will save to maintain their castings. Flying and incorporeal creatures are obviously unaffected by the spell. Additional effects occur depending on the surrounding terrain: Inside Caves, Tunnels, Buildings, or in Rocky Terrain: There is a 50% chance that the roof collapses, a wall falls down, or an avalanche begins, doing 6d8 points of damage to any creature in the area of effect as debris cascades down atop them. A Ref save reduces the damage by half. A failed save indicates the creature is buried and suffocating in the rubble. Such creatures must make a Stamina check (DC 10) each round or lose an additional 1d3 hit points until rescued or dead. Open Ground: There is a 25% chance a fissure opens under the feet of each creature in the area (Ref save to avoid falling in). The fissure is 10’ deep and creatures take 1d6 falling damage. River, Marsh, or Lake: Fissures open beneath the surface, causing the waters to drain away and leave a morass of boggy muck behind. There is a 25% chance each creature in the area is trapped in the mud and must make a DC 10 Strength check to pull free. The following round, the remaining waters rush back into the area and possible drowning may occur.",
          "24-25": "The ground quakes violently in an 80’ radius area centered at a point up to 200’ away from the cleric. All creatures standing in the area of effect must make a Ref save to remain standing; those who fail take 1d6 damage from a hard fall. This is the only action allowable during the round; no attacks or spellcasting is possible as the affected targets struggle to remain standing. Creatures in the area of effect suffer a -4 penalty to AC as they lose their defensive stance, and spellcasters concentrating on active spells must make a DC 15 Will save to maintain their castings. Flying and incorporeal creatures are obviously unaffected by the spell. Additional effects occur depending on the surrounding terrain: Inside Caves, Tunnels, Buildings, or in Rocky Terrain: There is a 75% chance that the roof collapses, a wall falls down, or an avalanche begins, doing 7d8 points of damage to any creature in the area of effect as debris cascades down atop them. A Ref save reduces the damage by half. A failed save indicates the creature is buried and suffocating in the rubble. Such creatures must make a Stamina check (DC 12) each round or lose an additional 1d4 hit points until rescued or dead. Open Ground: There is a 50% chance a fissure opens under the feet of each creature in the area (Ref save to avoid falling in). The fissure is 1d4x10’ deep and creatures take 1d6 falling damage for every 10’ fallen. River, Marsh, or Lake: Fissures open beneath the surface, causing the waters to drain away and leave a morass of boggy muck behind. There is a 50% chance each creature in the area is trapped in the mud and must make a DC 14 Strength check to pull free. The following round, the remaining waters rush back into the area and possible drowning may occur.",
          "26-27": "The ground quakes tempestuously in a 100’ radius area centered up to 400’ away from the cleric. The quakes continue for 1d3+1 rounds, affecting all within as follows for each round: All creatures standing in the area of effect must make a Ref save to remain standing; those who fail take 1d8+1 damage from a hard fall. This is the only action allowable during the round; no attacks or spellcasting is possible as the affected targets struggle to remain standing. Creatures in the area of effect suffer a -4 penalty to AC as they lose their defensive stance, and spellcasters concentrating on active spells must make a DC 17 Will save to maintain their castings. Flying and incorporeal creatures are obviously unaffected by the spell. Additional effects occur depending on the surrounding terrain: Inside Caves, Tunnels, Buildings, or in Rocky Terrain: There is a 90% chance that the roof collapses, a wall falls down, or an avalanche begins, doing 8d8 points of damage to any creature in the area of effect as debris cascades down atop them. A Ref save reduces the damage by half. A failed save indicates the creature is buried and suffocating in the rubble. Such creatures must make a Stamina check (DC 12) each round or lose an additional 1d5 hit points until rescued or dead. Open Ground: There is a 75% chance a fissure opens under the feet of all creatures in the area (Ref save to avoid falling in). The fissure is 1d6x10’ deep and creatures take 1d6 falling damage for every 10’ fallen. In addition, there is a 25% chance that each fissure closes 1d4+3 rounds later. Any creatures caught in a closing fissure takes 10d10 damage as the earth grinds them to pulp. Creatures that survive begin suffocating and must make a Stamina check (DC 16) each round or lose an additional 1d6 hit points until rescued or dead. River, Marsh, or Lake: Fissures open beneath the surface, causing the waters to drain away and leave a morass of boggy muck behind. There is a 75% chance each creature in the area is trapped in the mud and must make a DC 14 Strength check to pull free. The following round, the remaining waters rush back into the area and possible drowning may occur.",
          "28-33": "The ground quakes in a 125’ radius area, centered up to 500’ away from the cleric. The quakes continue for 1d4+1 rounds, affecting all within as follows for each round: All creatures standing in the area of effect must make a Ref save to remain standing; those who fail take 1d8+3 damage from a hard fall. This is the only action allowable during the round; no attacks or spellcasting is possible as the affected targets struggle to remain standing. Creatures in the area of effect suffer a -4 penalty to AC as they lose their defensive stance, and spellcasters concentrating on active spells must make a DC 19 Will save to maintain their castings. Incorporeal creatures are unaffected by the spell, but flying creatures may be caught in gusty updrafts; any creature flying within 50’ of the ground must make a DC 20 Ref save or be tossed to the ground for 2d6 damage. Additional effects occur depending on the surrounding terrain: Inside Caves, Tunnels, Buildings, or in Rocky Terrain: The roof collapses, a wall falls down, or an avalanche begins, doing 9d8 points of damage to any creature in the area of effect as debris cascades down atop them. A Ref save reduces the damage by half. A failed save indicates the creature is buried and suffocating in the rubble. Such creatures must make a Stamina check (DC 14) each round or lose an additional 1d6 hit points until rescued or dead. Open Ground: A fissure opens under the feet of all creatures in the area (Ref save to avoid falling in). The fissure is 2d6x10’ deep and creatures take 1d6 falling damage for every 10’ fallen. In addition, there is a 50% chance that each fissure closes 1d4+1 rounds later. Any creatures caught in a closing fissure takes 10d10 damage as the earth grinds them to pulp. Even if they survive they begin suffocating, and must make a Stamina check (DC 16) each round or lose an additional 1d6 hit points until rescued or dead. River, Marsh, or Lake: Fissures open beneath the surface, causing the waters to drain away and leave a morass of boggy muck behind. Each creature in the area is trapped in the mud and must make a DC 16 Strength check to pull free. The following round, the remaining waters rush back into the area and possible drowning may occur.",
          "34-35": "The ground quakes in a 150’ radius area, centered up to 600’ away from the cleric. The quakes continue for 1d5+2 rounds, affecting all within as follows for each round: All creatures standing in the area of effect must make a Ref save to remain standing; those who fail take 1d8+5 damage from a hard fall. This is the only action allowable during the round; no attacks or spell casting is possible as the affected targets struggle to remain standing. Creatures in the area of effect suffer a -4 penalty to AC as they lose their defensive stance, and spell-casters concentrating on active spells must make a DC 21 Will save to maintain their castings. Incorporeal creatures are unaffected by the spell, but flying creatures may be caught in gusty updrafts; any creature flying within 50’ of the ground must make a DC 20 Ref save or be tossed to the ground for 2d6 damage. Additional effects occur depending on the surrounding terrain: Page 298 Inside Caves, Tunnels, Buildings, or in Rocky Terrain: The roof collapses, a wall falls down, or an avalanche begins, doing 10d8 points of damage to any creature in the area of effect as debris cascades down atop them. A Ref save reduces the damage by half. A failed save indicates the creature is buried and suffocating in the rubble. Such creatures must make a Stamina check (DC 16) each round or lose an additional 1d6 hit points until rescued or dead. Open Ground: A fissure opens under the feet of all creatures in the area (Ref save to avoid falling in). The fissure is 3d6x10’ deep and creatures take 1d6 falling damage for every 10’ fallen. In addition, there is a 50% chance that each fissure closes 1d4+1 rounds later. Any creature caught in a closing fissure takes 10d10 damage as the earth grinds them to a pulp. Creatures that survive begin suffocating and must make a Stamina check (DC 16) each round or lose an additional 1d6 hit points until rescued or dead. River, Marsh, or Lake: Fissures open beneath the surface, causing the waters to drain away and leave a morass of boggy muck behind. Each creature in the area is trapped in the mud and must make a DC 18 Strength check to pull free. The following round, the remaining waters rush back into the area and possible drowning may occur.",
          "36-37": "The cleric wreaks destruction upon an area a half-mile in radius, at a point centered up to 10 miles away. He need not have line of sight to the target location. Massive tremors topple entire fortresses; dams collapse; villages, farmlands, animals, and people are engulfed in chasms; roaring flames erupt from lava spouts; and other titanic examples of devastation occur. The judge may allow those in the area of effect a saving throw to avoid death, but the force of the quake and the damage caused by it is likely fatal to all. Even flying creatures are caught in the updrafts and stormy winds created by the event. The landscape remains permanently altered in the aftermath.",
          "38+": "The cleric wreaks destruction upon an area 3 miles in radius, centered at any point he can see, even beyond this plane. Scrying devices may allow him to cast this spell over great distances. Massive tremors topple entire fortresses; dams collapse; villages, farmlands, animals, and people are engulfed in chasms; roaring flames erupt from lava spouts; and other titanic examples of devastation occur. The judge may allow those in the area of effect a saving throw to avoid death, but the force of the quake and the damage caused by it is likely fatal to all. Even flying creatures are caught in the updrafts and stormy winds created by the event. The landscape remains permanently altered in the aftermath."
        }
      }
    ]
  }
  