{
    "table_name": "crit-table-3",
    "notes": "",
    "general": "",
    "sub_tables": [
        {
            "subtable_name": "Results",
            "dice_size": "1d20",
            "table": {
                "0": "Battle rage makes friend and foe indistinguishable. Foe is hit for +1d12 damage, and the ally nearest him is also hit by a rebounding blow for 1d4 damage.",
                "1": "Savage attack! Inflict +1d6 damage with this strike.",
                "2": "Attack sweeps foe off his feet. Next round, the enemy is prone.",
                "3": "Foe steps into attack. Inflict +1d8 damage with this strike.",
                "4": "Powerful strike hammers foe to his knees. Make another attack.",
                "5": "Smash foe’s nose in an explosion of blood. Inflict +1d6 damage with this strike, and the foe loses his sense of smell for 1d4 hours.",
                "6": "Brutal strike to torso. Inflict +1d8 damage with this strike, and the foe suffers multiple broken ribs.",
                "7": "Strike to hand knocks weapon into the air. The weapon lands 1d20+5’ away.",
                "8": "Blow caroms off skull, deafening foe for 1d6 days. Inflict +1d6 damage with this strike.",
                "9": "Strike to leg splinters femur. Inflict +2d6 damage with this strike and foe loses 10’ of movement until healed.",
                "10": "Sunder foe’s weapon! Shards of metal fill the air.",
                "11": "Strike hammers foe’s belly causing massive internal bleeding. Unless he receives magical healing, the foe dies in 1d5 hours.",
                "12": "Blow to cranium staggers foe. The foe must make a Fort save (10 + PC level) or sink to floor, unconscious.",
                "13": "Strike breaks foe’s jaw. Blood and shattered teeth ooze down the foe’s face. Inflict +1d8 damage with this strike.",
                "14": "Attack hammers foe’s torso. Inflict +2d8 damage with this strike.",
                "15": "Strike dislocates shoulder! Inflict +1d8 damage and shield arm hangs loosely by muscle and skin; no AC bonus from shield.",
                "16": "Attack reduces foe’s attack hand to formless tissue; -4 penalty to future attacks.",
                "17": "Furious blows hammer target prone. Make another attack.",
                "18": "Blow hammers shards of bone into foe’s forebrain; gray matter oozes out. Inflict +1d8 damage with this strike, and the foe suffers 1d4 points of Int and Per loss.",
                "19": "Devastating strike to the chest. Inflict +2d8 damage with this strike.",
                "20": "Chest strike stuns foe for 1d3 rounds. Inflict +1d8 damage with this strike.",
                "21": "Strike to leg shatters femur, knocking foe to the ground. Foe’s movement drops by half. Inflict +2d8 damage with this strike and make another attack.",
                "22": "Weapon arm sundered by strike. The weapon is lost along with any chance of making an attack with this arm.",
                "23": "Blow craters skull. Inflict +2d8 damage with this strike, and the target permanently loses 1d4 Int and Per.",
                "24": "Masterful strike to throat. Inflict +2d8 damage with this strike and the foe staggers about gasping for air for 1d4 rounds.",
                "25": "Attack punches shattered ribs through lungs. Foe loses 50% of his remaining hit points and vomits copious amounts of blood.",
                "26": "Attack shatters foe’s face, destroying both eyes. Inflict +2d8 damage with this strike, and the foe is permanently blinded.",
                "27": "Crushing blow hammers chest. Inflict +3d8 damage with this strike, and the foe must make a Fort save (DC 15 + PC level) or be knocked unconscious.",
                "28+": "Blow destroys spinal column. Inflict +3d8 damage with this strike, and the foe must make a Fort save (DC 15 + PC level) or suffer paralysis."
            }
        }
    ]
}
