{
    "table_name": "crit-table-5",
    "notes": "",
    "general": "",
    "sub_tables": [
        {
            "subtable_name": "Results",
            "dice_size": "1d20",
            "table": {
                "0": "Battle rage makes friend and foe indistinguishable. Foe is hit for +3d8 damage, and the ally nearest him is also hit by a rebounding blow for 1d4 damage.",
                "1": "Foe’s weapon shattered. If the foe has no weapon, inflict +3d12 damage with this strike.",
                "2": "Furious assault hurls foe back 1d10’. Any adjacent foes accidentally strike the target for damage.",
                "3": "Blow to skull destroys ear. Inflict +1d12 damage with this strike, and the foe suffers permanent deafness.",
                "4": "Strike to gut! The foe must make a Fort save (DC 20 + PC level) or spend the next 2 rounds retching bile from a ruptured stomach.",
                "5": "Foe casts weapon away and wails for mercy. Inflict +1d12 damage with this strike and make another attack.",
                "6": "Strike scalps foe. Blood courses down his face, and the foe is effectively blinded until healed.",
                "7": "Foe entangled on your weapon, reducing his AC by -6 while caught. Make another attack.",
                "8-12": "You see red! Inflict +1d12 damage with this strike as you are overcome by battle rage.",
                "13-14": "Strike to weapon arm. Foe takes quadruple damage from his own weapon as it is hammered into his face. Foe drops weapon in dumbfounded awe.",
                "15": "Blow sunders shield. Inflict +2d12 damage with this strike. If the foe has no shield, he must make a Fort save (DC 20 + PC level) or be knocked unconscious from the pain.",
                "16": "Strike to top of skull shortens spinal column, shortening foe by 6”. Resulting nerve damage reduces foe’s AC by -4.",
                "17": "Target is disemboweled, spilling his entrails onto the ground. Foe dies instantly of shock.",
                "18": "Blow destroys target’s face. Foe is immediately rendered blind and deaf and is now capable of only wet, gurgling sounds.",
                "19": "Strike removes crown of target’s skull. Foe dies from exposed brain matter in 3d3 rounds.",
                "20": "Blow severs shield arm. Inflict +2d12 damage with this strike. Foe’s hopes of two-handed weapon mastery dashed.",
                "21": "Godly attack. Inflict +3d12 damage with this strike. If the target dies, move up to 10’ and make another attack on any foe within 10’.",
                "22": "Blow severs leg. Inflict +2d12 damage with this strike, and the foe’s movement drops to zero. Foe does nothing but wail in agony for 1d4 rounds.",
                "23": "Strike to skull stuns foe for 1d4+1 rounds and permanently reduces Int by 1d12. Make another attack on your inert foe.",
                "24": "Strike severs weapon arm. Inflict +2d12 damage with this strike, and the foe is disarmed, literally and figuratively.",
                "25": "Devastating strike to torso voids foe’s bowels and crushes organs into paste. Foe loses 50% of current hit points and all dignity.",
                "26": "Strike crushes throat. Foe begins drowning in his own blood and expires in 1d4 rounds.",
                "27": "Crippling blow to spine. Inflict +4d12 damage with this strike, and the foe suffers permanent paralysis.",
                "28+": "Foe decapitated with a single strike. You are Death incarnate. Continue to make attacks against any foes within 10’ until you miss."
            }
        }
    ]
}
