{
    "table_name": "curse",
    "notes": "Level: 2 -- Range: Sight -- Duration: Varies (see below) -- Casting time: 1 round -- Save: Will vs. spell check DC",
    "general": "The cleric utters a profound curse upon another creature, which always receives a Will save to resist. This spell must be used carefully, for it is considered a powerful act of intervention by one’s deity. Uttering severe curses, such as those that affect entire families or communities or which extend across the generations, are considered a sin. Longer rituals entailing longer casting times may be appropriate for more sinister curses.",
    "sub_tables": [
      {
        "subtable_name": "Manifestation",
        "dice_size": "1d3",
        "table": {
          "1": "Your hair will remain white for as long as this curse shall last",
          "2": "The mark of a sinner shall be visible on your breast for as long as this curse shall last",
          "3": "A physical manifestation, such as a glowing symbol or a visible scar, appears on the target"
        }
      },
      {
        "subtable_name": "Spell Results",
        "dice_size": "1d20",
        "table": {
          "1-13": "Failure.",
          "14-15": "The cleric casts a simple curse on one target that inflicts a -1 Luck penalty for 24 hours.",
          "16-19": "The cleric casts a curse on one target that inflicts a -2 Luck penalty and a -1 penalty to one other statistic of the cleric’s choice for up to a week. The statistic can be attack rolls, damage rolls, an ability score, saving throws, spell checks, Armor Class, speed (where -1 = -5’), hit points, and so on.",
          "20-21": "The cleric casts a curse on one target that inflicts a -2 Luck penalty and a -2 penalty to one other statistic of the cleric’s choice for up to a week. The statistic can be attack rolls, damage rolls, an ability score, saving throws, spell checks, Armor Class, speed (where -1 = -5’), hit points, and so on. Alternately, the cleric may choose to invoke a specific physical or mental limitation for one week. For example, the target cannot speak, cannot walk, cannot sleep, cannot see, etc.",
          "22-25": "The cleric casts a curse on one target that inflicts a -2 Luck penalty, a -2 penalty to one other statistic, and a specific physical or mental limitation (e.g., cannot speak, sleep, see, walk, etc.). The statistic can be attack rolls, damage, an ability score, saving throws, spell checks, Armor Class, speed (where -1 = -5’), hit points, and so on. The duration is ongoing until some specific condition is met. The condition must have meaning to the cleric’s deity or the target, and it must be within the target’s power to achieve (even if very difficult). For example, “you cannot see until you kiss the medusa queen” or “you cannot sleep until you close your eyes beneath the tomb of the sleepless demon.”",
          "26-29": "The cleric casts a curse on a group of people: a family, a community, a village, an adventuring group, etc. The cleric can affect up to 10 people at once as long as they are part of a single defined group. The curse inflicts a -2 Luck penalty, a -2 penalty to one other statistic, and a specific physical or mental limitation (e.g., cannot speak, sleep, see, walk, etc.). The statistic can be attack rolls, damage, an ability score, saving throws, spell checks, Armor Class, speed (where -1 = -5’), hit points, and so on. The duration is ongoing until some specific condition is met. The condition must have meaning to the cleric’s deity or the target, and it must be within the target’s power to achieve (even if very difficult). For example, “you cannot see until you kiss the medusa queen” or “you cannot sleep until you close your eyes beneath the tomb of the sleepless demon.”",
          "30-31": "The cleric casts a curse on a large group of people: a family, a community, a village, an adventuring group, residents of a castle, etc. The cleric can affect up to 50 people at once as long as they are part of a single defined group. The curse inflicts a -2 Luck penalty, a -2 penalty to two other statistics, and a specific physical or mental limitation (e.g., cannot speak, sleep, see, walk, etc.). The statistics can be attack rolls, damage, an ability score, saving throws, spell checks, Armor Class, speed (where -1 = -5’), hit points, and so on. The duration is ongoing until some specific condition is met. The condition must have meaning to the cleric’s deity or the target, and it must be within the target’s power to achieve (even if very difficult). For example, “you cannot see until you kiss the medusa queen” or “you cannot sleep until you close your eyes beneath the tomb of the sleepless demon.”",
          "32-33": "The cleric casts a curse on a very large group of people: a family, a community, a village, an adventuring group, residents of a castle, etc. The cleric can affect up to 100 people at once as long as they are part of a single defined group. The curse inflicts a -4 Luck penalty, a -2 penalty to three other statistics, and a specific physical or mental limitation (e.g., cannot speak, sleep, see, walk, etc.). The statistic can be attack rolls, damage, an ability score, saving throws, spell checks, Armor Class, speed (where -1 = -5’), hit points, and so on. The duration is ongoing until some specific condition is met. The condition must have meaning to the cleric’s deity or the target, and it must be within the target’s power to achieve (even if very difficult). For example, “you cannot see until you kiss the medusa queen” or “you cannot sleep until you close your eyes beneath the tomb of the sleepless demon.”",
          "34+": "The cleric casts a curse on an extremely large group of people: a family, a community, a village, an adventuring group, residents of a castle, etc. The cleric can affect up to 1,000 people at once as long as they are part of a single defined group. In addition, the curse carries on to the heirs of those affected, and propagates through the generations until removed. The curse inflicts a -4 Luck penalty, a -2 penalty to three other statistics, and a specific physical or mental limitation (e.g., cannot speak, sleep, see, walk, etc.). The statistic can be attack rolls, damage, an ability score, saving throws, spell checks, Armor Class, speed (where -1 = -5’), hit points, and so on. The duration is ongoing until some specific condition is met. The condition must have meaning to the cleric’s deity or the target, and it must be within the target’s power to achieve (even if very difficult). For example, “you cannot see until you kiss the medusa queen” or “you cannot sleep until you close your eyes beneath the tomb of the sleepless demon.”"
        }
      }
    ]
  }
  