{
    "table_name": "dispel-magic",
    "notes": "Level: 3 -- Range: Touch or more -- Duration: From instantaneous to permanent -- Casting time: 1 round or longer -- Save: Sometimes (Will vs. spell check DC)",
    "general": "With this spell, the caster disrupts arcane energies. This spell can break a pentagram, banish a summoned demon, neutralize a magical potion, or cancel another spell. At its most fundamental level, this spell is a test of wills: the caster attempts to master and break the magical energies already bound together by a rival magic-user. If the caster is stronger, he dispels the enemy magic. If his rival is stronger, the magic stays in place. In most cases, concentration aids this spell immensely. A simple dispel magic can be cast in 1 round, and can achieve a maximum spell check result of 21, regardless of die roll, as noted below. For every round of concentration while casting the spell, the spell check can be incrementally higher, as noted on the table below. A higher casting time does not guarantee a better result, but spell check results are capped based on the casting time. This spell may also be used to counterspell any opposed casting. When used in this manner it can achieve any level of effect regardless of casting time. When casting this spell, the effect to be dispelled must have been created with a spell check of equal to or less than the caster’s, and the opposing caster receives a Will save. For example, if the caster rolled 16 on the dispel magic spell check, he could cancel an enemy’s mirror image that was created with a spell check of 15 or less. If the opposing spell check is not known, the judge should roll it on the spot. The caster does not necessarily know the strength of the magical spell or effect he is attempting to dispel. In some cases, as noted below, the opposing caster may prevent a spell from being dispelled by making a Will save against the caster’s spell check. For example, the owner of the mirror image spell could attempt to maintain its functioning by making a Will save of greater than or equal to the caster’s spell check result.",
    "sub_tables": [
      {
        "subtable_name": "Manifestation",
        "dice_size": "1d1",
        "table": {
          "1": "Varies."
        }
      },
      {
        "subtable_name": "Corruption",
        "dice_size": "1d6",
        "table": {
          "1": "caster loses 10 pounds permanently",
          "2": "caster absorbs traits of the spell he attempted to dispel, at the judge’s discretion; for example, if he was trying to dispel choking cloud, then his breath becomes permanently noxious",
          "3": "caster gains 20 pounds permanently",
          "4": "minor",
          "5": "major",
          "6": "greater"
        }
      },
      {
        "subtable_name": "Misfire",
        "dice_size": "1d4",
        "table": {
          "1": "a randomly determined magic item on the caster’s person (if any) is partially disenchanted, permanently losing one “plus” or special ability",
          "2": "instead of targeting what the caster intended, the dispel effect targets one randomly determined spell effect within 50’, which is automatically suppressed for 1d6 rounds",
          "3": "the spell enhances magical effects instead of dispelling them, such that all spell checks made within 20’ of the caster (including the caster’s) receive a +1 bonus for the next 1d6 rounds",
          "4": "the spell releases the energy of the last spell the caster dispelled and casts it at a spell check result of 1d10+14; for example, if the last spell dispelled was a choking cloud, then a new choking cloud suddenly appears; if the judge and player cannot remember the last spell dispelled, determine one randomly of level 1d4 on Table 5-8: Wizard Spells"
        }
      },
      {
        "subtable_name": "Spell Results",
        "dice_size": "1d20",
        "table": {
          "1": "Lost, failure, and worse! Roll 1d6 modified by Luck: (0 or less) corruption + patron taint + misfire; (1-2) corruption; (3) patron taint (or corruption if no patron); (4+) misfire.",
          "2-11": "Lost. Failure.",
          "12-15": "Failure, but spell is not lost.",
          "16-17": "The caster potentially cancels the active effects of a single spell with a non-permanent duration. The caster must touch the spell effect to dispel it. Depending on the specifics, this might mean he touches a summoned creature and causes it to return to its native place, disperses a choking cloud, causes an invisible creature to become visible, or awakens a person subjected to magical sleep. Spells with permanent durations or that create permanent bonds, such as find familiar, patron bond, or wizard staff, are not affected, nor are spells whose magical effects have now “passed,” even though they generated a non-magical effect (for example, the caster could not “re-break” a broken sword that was repaired with a mending spell). The opposing caster may prevent his spell from being dispelled by making a Will save against the caster’s spell check.",
          "18-21": "The caster potentially cancels the active effects of a single spell with a non-permanent duration. The caster must be within 20’ of the spell effect to dispel it. Depending on the specifics, this might mean he touches a summoned creature and causes it to return to its native place, disperses a choking cloud, causes an invisible creature to become visible, or awakens a person subjected to magical sleep. Spells with permanent durations or that create permanent bonds, such as find familiar, patron bond, or wizard staff, are not affected, nor are spells whose magical effects have now “passed,” even though they generated a non-magical effect (for example, the caster could not “re-break” a broken sword that was repaired with a mending spell). The opposing caster may prevent his spell from being dispelled by making a Will save against the caster’s spell check.",
          "22-23": "The caster potentially cancels the active effects of all spell effects within 20’ that have a non-permanent duration. This includes “friendly” spell effects. Spells with permanent durations or which create permanent bonds, such as find familiar, patron bond, or wizard staff, are not affected, nor are spells whose magical effects have now “passed,” even though they generated a non-magical effect (for example, the caster could not “re-break” a broken sword that was repaired with a mending spell). Opposing casters do not receive a Will save against this casting to prevent the dispel. If the caster’s spell check exceeds the spell check used to create opposed spells, the spells are automatically dispelled.",
          "24-26": "The caster potentially cancels certain spell effects within 20’. This includes “friendly” spell effects. All spell effects of a non-permanent nature are affected, as well as select magic items. Potions and magic scrolls within range are permanently neutralized. Magic staffs and weapons within the area of effect may have their magical effects (their “pluses” and other abilities) temporarily neutralized for 1d10 rounds, provided the spell check used to create them is less than the dispel magic spell check. Magic rods, wands, and unique magic items are not affected. Spells with permanent durations or which create permanent bonds, such as find familiar or patron bond, are not affected, nor are spells whose magical effects have now “passed,” even though they generated a non-magical effect (for example, the caster could not “re-break” a broken sword that was repaired with a mending spell). Opposing casters do not receive a Will save against this casting to prevent the dispel. If the caster’s spell check exceeds the spell check used to create opposed spells, the spells are automatically dispelled.",
          "27-31": "The caster potentially cancels certain spell effects within 20’. This includes “friendly” spell effects. All spell effects of a non-permanent nature are affected, as well as select magic items. Potions and magic scrolls within range are permanently neutralized. Magic staffs, rods, wands, weapons, and unique magic items within the area of effect may have their magical effects (their “pluses” and other abilities) temporarily neutralized for 1d10 rounds, provided the spell check used to create them is less than the dispel magic spell check. Spells with permanent durations or which create permanent bonds, such as find familiar or patron bond, are not affected, nor are spells whose magical effects have now “passed,” even though they generated a non-magical effect (for example, the caster could not “re-break” a broken sword that was repaired with a mending spell). Opposing casters do not receive a Will save against this casting to prevent the dispel. If the caster’s spell check exceeds the spell check used to create opposed spells, the spells are automatically dispelled.",
          "32-33": "The caster may choose to create a flash of dispelling magic, as result 27-31 above, or focus all spell energies on a single item, object, spell, or creature within 20’ to permanently disenchant it. If the latter, the spell check of the caster must exceed the spell check used to create the item, and a minimum spellburn of 1 point per “plus” of the item to be disenchanted is required. If successful, the item becomes a mundane example of its normal type. For example, with a successful check and 2 points of spellburn, a +2 sword becomes a regular longsword.",
          "34-35": "The caster creates a sphere of disenchantment that radiates 20’ from his person at all times and travels with him. This sphere acts as an ongoing dispel magic spell that permanently dispels spells and magic items, as noted in result 27-31 above. Additionally, if the caster expends spellburn, the sphere can permanently disenchant items, objects, spells, and creatures of a permanent duration, up to a “plus” equal to the spellburn expended, as noted in 32-33 above. The sphere of disenchantment lasts for 24 hours. Note that the sphere affects the caster’s own magic – he is effectively unable to cast magical spells while the sphere of disenchantment remains active unless he succeeds in a spell check greater than his original dispel magic check. He can dismiss the sphere at will.",
          "36+": "The caster creates a sphere of disenchantment that radiates 20’ from his person at all times and travels with him. The sphere can be placed on another object or person. The sphere then moves with that person or object. The subject need not be willing. This sphere acts as an ongoing dispel magic spell that permanently dispels spells and magic items, as noted in result 27-31 above. Additionally, if the caster expends spellburn, the sphere can permanently disenchant items, objects, spells, and creatures of a permanent duration, up to a “plus” equal to the spellburn expended, as noted in 32-33 above. The sphere of disenchantment lasts for 24 hours. Note that the sphere affects the caster’s own magic – he is effectively unable to cast magical spells while the sphere of disenchantment remains active unless he succeeds in a spell check greater than his original dispel magic check. He can dismiss the sphere at will."
        }
      }
    ]
  }
  