{
    "table_name": "ekims-mystical-mask",
    "notes": "Level: 1 -- Range: Self -- Duration: 1 round per CL -- Casting time: 1 action -- Save: See below",
    "general": "The caster conjures a mystical mask that covers his face and provides benefits against attacks, spells, and other conditions. On a successful casting, the wizard may choose to invoke an effect of lesser power than his spell check roll to produce a weaker but potentially more useful result.",
    "sub_tables": [
      {
        "subtable_name": "Manifestation",
        "dice_size": "1d4",
        "table": {
          "1": "The caster plucks the mask out of thin air.",
          "2": "The flesh on the caster’s face peels away to reveal the mask beneath.",
          "3": "The caster’s head becomes momentarily blurred and the mask is in place once the distortion passes.",
          "4": "The caster’s head appears to spin 180° revealing a masked face on the back of his head."
        }
      },
      {
        "subtable_name": "Corruption",
        "dice_size": "1d4",
        "table": {
          "1": "The caster’s face takes on an emotionless, artificial mien.",
          "2": "The flesh on the caster’s face turns dry and flakes away constantly.",
          "3": "The caster develops a phobia about revealing his true face and takes to wearing veils or hooded cloaks.",
          "4": "The caster’s nose vanishes completely, leaving his face flat and mask-like."
        }
      },
      {
        "subtable_name": "Misfire",
        "dice_size": "1d4",
        "table": {
          "1": "Caster is blinded by the mask for 1d3 rounds and suffers a -4 penalty to initiative rolls, attack rolls, saving throws, spell checks, and to avoid being surprised.",
          "2": "The caster’s mouth vanishes for 1d3 rounds and no spells may be cast during that time.",
          "3": "For the next day, the caster’s eyes become hypersensitive to light and he suffers a -2 penalty to all attacks, saves, spell checks, ability checks, and initiative rolls when in illumination brighter than candle light.",
          "4": "The caster’s face vanishes completely, rendering him blind and mute; in addition, he must make a DC 10 Fort save each round or pass out from asphyxiation; his face returns to normal once the spell’s duration has expired."
        }
      },
      {
        "subtable_name": "Spell Results",
        "dice_size": "1d20",
        "table": {
          "1": "Lost, failure, and worse! Roll 1d6 modified by Luck: (0 or less) corruption + patron taint + misfire; (1-2) corruption; (3+) misfire.",
          "2-11": "Lost. Failure.",
          "12-13": "The mask grants infravision, allowing the caster to see in the dark up to 60’ away. His eyes reflect light like a cat while this mask is in effect.",
          "14-17": "The mask helps protect the caster against gaze attacks such as that from a basilisk. The caster enjoys a +4 bonus to saving throws of any type against gaze attacks for the duration of the spell. The caster’s face takes on a mirror-like quality while this mask is in effect.",
          "18-19": "The mask helps defend the caster against baneful magical spells. All spells cast directly at the wizard suffer a -2 penalty to their spell checks. Area-of-effect spells or other magics that are not targeted directly at the mask wearer are unmodified. The caster’s face takes on a faceted, quartz-like appearance while this mask is in effect.",
          "20-23": "The mask transforms the caster’s face into a horrible visage. Each round he can attempt to instill fear in one creature. The target creature must make a Will save or flee from the caster’s location for 1d4+CL rounds. The targeted creature must be able to see the caster clearly to be affected by the gaze. The caster can attempt to affect one creature each round for the duration of the spell and can try to instill fear on the same creature more than once, requiring it to make a new saving throw with each attempt. The caster’s face becomes monstrously demonic while this mask is in effect.",
          "24-27": "The mask protects the caster against physical attacks, granting him a +4 bonus to AC while the spell is in effect. In addition, the caster enjoys a +2 bonus to all saving throws for the duration of the spell. The caster’s face appears encased in shining steel while this mask is in effect.",
          "28-29": "The mask reflects melee and ranged attacks back at unlucky assailants. Any attacker that successfully strikes the mask’s wearer with a physical melee or missile attack must make a Luck check or find their attack turned against them. The attacker’s same attack roll (including any and all modifiers) is applied to its own AC and inflicts normal damage if the blow lands successfully. The caster’s face appears to be that of his attacker(s) while the mask is in effect.",
          "30-31": "The mask transforms the caster’s entire head into that of a snake. While in effect, the mask grants the caster both the illusion generating and hypnotic gaze powers of a serpent-man (see page 425). As an incidental benefit, it also allows the caster to pass himself off as a serpent-man under cursory inspection. The mask’s effect on the caster’s face is self-evident.",
          "32+": "With this powerful casting, the wizard’s face is occluded by a mask that combines all the spell’s possible effects into a single visage. The caster has infravision up to 60’; gains a +4 saving throw bonus against gaze attacks; harmful spells cast directly at the caster suffer a -2 penalty to spell checks; the caster can instill fear against any creature that fails a Will save, forcing it to flee for 1d4+CL rounds; the caster’s AC is improved by +4, and all saves receive a +2 bonus (this stacks with the +4 bonus against gaze attacks); any attacker who successfully strikes the caster with a physical melee or missile attack must make a Luck check or possibly be struck by its own attack (compare the initial attack roll against its own AC); and the caster’s face is transformed into a serpent’s head, granting him the illusionary and hypnotic capabilities of a serpent-man (see page 425). At this level of success, the mask makes no alterations to the caster’s face other than the snake’s head transformation (which can be obscured with the illusion generation ability granted by that alteration)."
        }
      }
    ]
  }
  