{
    "table_name": "enter-the-green",
    "notes": "Level: 3 (Yddgrrl) -- Range: Varies -- Duration: Special -- Casting time: 1 Turn -- Save: None",
    "general": "The caster, and possibly one or more allies, use the World Root to travel from one place to another. The travellers enter through a tree or a large mass of plants, and exit through the same. If the caster knows of a suitable exit within range, she may choose to exit there. Otherwise, the caster can choose a general area, and the judge will determine exactly where the travellers exit from. Transit through the Green takes an apparent 10 minutes in the real world, but the actual time lapse for the travellers is determined by the spell check result. Companions taken into the Green cannot become separated from the caster.",
    "sub_tables": [
        {
            "subtable_name": "Manifestation",
            "dice_size": "1d4",
            "table": {
                "1": "A shimmering green opening appears in the vegetation, allowing the travellers to enter before it disappears.",
                "2": "The travellers seem to fade away as they approach the vegetation they are using to enter the Green.",
                "3": "Plant material rapidly grows around them, bringing them into the Green, and opens to reveal them at their destination.",
                "4": "A giant beanstalk appears, which the travellers must climb to reach their destination. The beanstalk and those upon it are visible only to creatures within 20’."
            }
        },
        {
            "subtable_name": "Spell Results",
            "dice_size": "1d20",
            "table": {
                "1": "Lost, failure, and patron taint.",
                "2-11": "Lost. Failure.",
                "12-15": "Failure, but the spell is not lost.",
                "16-17": "The caster enters the Green, re-emerging within 100’ of her starting point. Although only 10 minutes appears to have passed in the outside world, the caster has 1d3 days to prepare for her reappearance.",
                "18-21": "The caster and up to 1d3 companions can travel up to 10 miles through the Green. Although only 10 minutes passes in the outside world, 2d24 hours pass for the travellers.",
                "22-23": "The caster and up to 5 companions can travel up to 25 miles through the Green. Although only 10 minutes passes in the outside world, 3d12 hours pass for the travellers.",
                "24-26": "The caster and up to 5 companions can travel up to 50 miles through the Green. Although only 10 minutes passes in the outside world, 3d8 hours pass for the travellers.",
                "27-31": "The caster and up to 10 companions can travel up to 100 miles through the Green. Although only 10 minutes passes in the outside world, 3d7 turns pass for the travellers.",
                "32-33": "The caster and up to 10 companions can travel up to 500 miles through the Green. Although 10 minutes pass in the outside world, 2d6 minutes pass for the travellers.",
                "34-35": "The caster and up to 30 companions can travel up to 500 miles through the Green. Although 10 minutes pass in the outside world, only 2d6 rounds pass for the travellers.",
                "36+": "The caster and up to 30 companions can travel through the Green to any point on the same world, or even to other planets or planes, so long as they have the requisite vegetation to connect them to Yddgrrl. Although 10 minutes pass in the outside world, travel is instantaneous for the travellers."
            }
        }
    ]
}
