{
    "table_name": "esp",
    "notes": "Level: 2 -- Range: 100’ or more -- Duration: 1 round or more -- Casting time: 1 round -- Save: Will vs. spell check DC",
    "general": "l The caster can detect the thoughts of other creatures. Lower check results allow the caster to read only surface-level thoughts. With higher check results the caster can concentrate and read deeper levels of thought with each round of continuous concentration, as follows. Detecting the answer to a specific question within the scope of the thoughts described below generally takes 1d4 rounds once the appropriate round of concentration is reached. For example, finding out where an evil necromancer hid his magic ring takes 1d4 rounds after the 4th round of concentration (recent memories), and understanding why the necromancer bears an irrational hatred toward the king takes 1d4 rounds after the 6th round of concentration (subconscious motivations). Round 2: The caster understands any long-range goals and motivations associated with the creature’s current thoughts and actions. Round 3: The caster understands the creature’s relationships with its friends and enemies. Round 4: The caster can read the creature’s recent memories. It still takes time to sort through all the thoughts – roughly one round for every day of memories. Round 5: The caster can read the creature’s historical memories – as far back as it can remember. Round 6: The caster understands the creature’s subconscious thoughts – motivations and underlying behaviors that it may not even be aware of. Certain higher check results allow the caster to switch targets. Switching to a new target triggers a new Will save for the new target, and resets the “round counter” for purposes of reading deep thoughts. For example, if the caster concentrated for three rounds on one target, then switched to a second, then switched back to the first, it would be as if he was starting back at one round of concentration.",
    "sub_tables": [
      {
        "subtable_name": "Manifestation",
        "dice_size": "1d5",
        "table": {
          "1": "Nothing visible.",
          "2": "Caster’s head glows.",
          "3": "Caster’s eyes turn misty.",
          "4": "Shimmering waves emanate from caster’s skull.",
          "5": "Flashes of light jump from caster periodically."
        }
      },
      {
        "subtable_name": "Corruption",
        "dice_size": "1d8",
        "table": {
          "1": "Caster’s skull expands grotesquely as his brain doubles in size.",
          "2": "Caster’s eyes turn permanently clouded.",
          "3": "Caster’s thoughts are visible as waves of shimmering light that radiate outward from his skull.",
          "4": "Caster goes completely bald.",
          "5": "Minor corruption.",
          "6": "Major corruption.",
          "7": "Minor corruption.",
          "8": "Major corruption."
        }
      },
      {
        "subtable_name": "Misfire",
        "dice_size": "1d4",
        "table": {
          "1": "Caster accidentally broadcasts his thoughts to all creatures within 30’, which suddenly know his mood and deepest opinions of them.",
          "2": "Caster touches the darkest, most savage portion of the nearest animal mind, causing him to recoil in pain and suffer a -1 penalty to all rolls for 1d4 rounds as he recovers.",
          "3": "Caster sends a burst of concentrated thoughts at 1d4 randomly determined creatures within 100’, each of whom suffers 1 hp of damage as the psychic blast causes a mind-splitting headache.",
          "4": "One creature about whom the caster has a deeply guarded secret learns about that secret as he accidentally transmits thoughts instead of receiving them."
        }
      },
      {
        "subtable_name": "Spell Results",
        "dice_size": "1d20",
        "table": {
          "1": "Lost, failure, and misfire.",
          "2-11": "Lost. Failure.",
          "12-13": "Failure, but spell is not lost.",
          "14-15": "By concentrating for a full round, the caster can read the thoughts of one creature he can see within 100’. The creature receives a Will save and is aware of an attempt to read its thoughts (though it may not know the caster is the one attempting the action). If the caster is successful, he detects surface-level thoughts: the creature’s emotional state, any actions it is intent upon, and so on. After the first round of concentration, the spell energy dissipates.",
          "16-19": "By concentrating for a full round, the caster can read the thoughts of one creature he can see within 100’. The creature receives a Will save, and is aware of an attempt to read its thoughts (though it may not know the caster is the one attempting the action). If the caster is successful, he detects surface-level thoughts: the creature’s emotional state, any actions it is intent upon, and so on. By continuing to concentrate, the caster can read deeper levels of thought, as noted in the general spell description. If the caster stops concentrating, the spell ends.",
          "20-21": "By concentrating for a full round, the caster can read the thoughts of one creature he can see within 500’. The creature receives a Will save and is aware of an attempt to read its thoughts (though it may not know the caster is the one attempting the action). If the caster is successful, he detects surface-level thoughts: the creature’s emotional state, any actions it is intent upon, and so on. By continuing to concentrate, the caster can read deeper levels of thought, as noted in the general spell description. If the caster stops concentrating, the spell ends.",
          "22-25": "By concentrating for a full round, the caster can read the thoughts of one creature he can see within 500’. In addition, the caster can switch targets each new round, as long as he continues concentrating. Any target (whether the first or a later one) receives a Will save and is aware of an attempt to read its thoughts (though it may not know the caster is the one attempting the action). If the caster is successful, he detects surface-level thoughts: the creature’s emotional state, any actions it is intent upon, and so on. By continuing to concentrate, the caster can read deeper levels of thought, as noted in the general spell description. If the caster stops concentrating, the spell ends.",
          "26-29": "By concentrating for a full round, the caster can read the thoughts of one creature. If the caster has a physical memento associated with a specific target (a hair clipping, fingernail, favorite sword, drop of blood, etc.), he can detect its thoughts at a distance of up to one mile, without needing line of sight. Without a physical memento, the caster can attempt ESP on a target within line of sight at a distance of up to 1,000’. Viewing a target through a scrying device, such as a crystal ball, counts as line of sight. In addition, the caster can switch targets each new round, as long as he continues concentrating. Any target (whether the first or a later one) receives a Will save and is aware of an attempt to read its thoughts (though it may not know the caster is the one attempting the action). If the caster is successful, he detects surface-level thoughts: the creature’s emotional state, any actions it is intent upon, and so on. By continuing to concentrate, the caster can read deeper levels of thought, as noted in the general spell description. If the caster stops concentrating, the spell ends.",
          "30-31": "By concentrating for a full round, the caster can read the thoughts of one creature. If the caster has a physical memento associated with a specific target (a hair clipping, fingernail, favorite sword, drop of blood, etc.), he can detect its thoughts at a distance of up to 100 miles, without needing line of sight. Without a physical memento, the caster can attempt ESP on a target within line of sight at a distance of up to 1 mile. Viewing a target through a scrying device, such as a crystal ball, counts as line of sight. In addition, the caster can switch targets each new round, as long as he continues concentrating. Targets of 2 HD or less do not receive a save. Targets of 3+ HD receive a save but are not aware of the attempt to read their minds, even if they make the save. The judge should roll the save for these targets. If the caster is successful, he detects surface-level thoughts: the creature’s emotional state, any actions it is intent upon, and so on. By continuing to concentrate the caster can read deeper levels of thought, as noted in the general spell description. If the caster stops concentrating, the spell ends.",
          "32-33": "The caster can detect the thoughts of multiple creatures. For a period of one day, he gains awareness of the swirling morass of all thoughts within 100 miles of his position. Much like the background noise of a forest, the caster can “hear” all thoughts. By concentrating, he can narrow the focus onto one creature. If the caster has line of sight, he can focus directly on that creature’s thoughts; if the caster has a physical memento (a hair clipping or drop of blood), he can focus directly on that creature (even if not in his line of sight); and if the caster knows a creature personally and it is within range, he can focus on that creature. All other thoughts remain clouded and indistinct, much like a distant murmur. When the caster has designated a specific creature, it receives no save if it is 2 HD or less and a Will save if 3 HD or more, but it is not aware of the attempt to read its mind even if it makes the save (the judge should roll). The judge should roll the save for these targets. If the caster is successful, he detects surface-level thoughts: the creature’s emotional state, any actions it is intent upon, and so on. By continuing to concentrate the caster can read deeper levels of thought, as noted in the general spell description. If the caster stops concentrating, the spell continues until the end of the day, and he need only focus on another target to resume reading minds.",
          "34+": "For a period of one month, the caster can detect the thoughts of multiple creatures. He gains awareness of the swirling morass of all thoughts within 100 miles of his position. Much like the background noise of a forest, the caster can “hear” all thoughts. By concentrating, the caster can narrow the focus onto one creature. If he has line of sight, he can focus directly on that creature’s thoughts; if the caster has a physical memento (a hair clipping or drop of blood), he can focus directly on that creature (even if not in his line of sight); and if the caster knows a creature personally and it is within range, he can focus on that creature. All other thoughts remain clouded and indistinct, much like a distant murmur, but the caster can choose to narrow the focus steadily. With a round of concentration, the caster can narrow the thoughts he hears to one category of creatures (for example, “all men” or “all warriors” or “all dwarves”). The caster can then continue to narrow the categories with subsequent rounds of concentration; each time he is aware of how many creatures remain part of the “murmur” and what general category of creature to which they belong. When there are only a dozen or so creatures left, the caster can sift through individuals, and choose to focus on one, even if it is unfamiliar to him. When the caster has designated a specific creature, it receives no save if it is 3 HD or less and a Will save if 4 HD or more, but it is not aware of the attempt to read its mind even if it makes the save (the judge should roll). The judge should roll the save for these targets. If the caster is successful, he detects surface-level thoughts: the creature’s emotional state, any actions it is intent upon, and so on. By continuing to concentrate, the caster can read deeper levels of thought, as noted in the general spell description. If the caster stops concentrating, the spell continues until the end of the month duration, and he need only focus on another target to resume reading minds. If the caster chooses, he can “anchor” his thoughts to those of a single target. This requires seven sequential rounds of concentration, and the target receives a second Will save after the seventh round. It is aware of this attempt and perceives that someone is trying to read its thoughts. If the target fails the save and the caster successfully anchors his thoughts, he remains aware of that target’s ongoing thought processes at all times. The caster effectively maintains an ongoing link to read the target’s mind. This link lasts until the end of the spell’s duration. However, while anchored to one target in this manner, the spell blocks out other background thoughts and the caster cannot hear the “overall murmur” of other thoughts around him."
        }
      }
    ]
  }
  