{
    "table_name": "fireball",
    "notes": "Level: 3 -- Range: 50’ or more, exploding in a sphere of 20’ radius or more -- Duration: Instantaneous -- Casting time: 1 round -- Save: Reflex vs. spell check",
    "general": "The caster points his finger at a target, speaks a magic word, and throws a jet of flame that explodes at the designated point. A fireball fills a sphere of 20’ radius, affecting all creatures within the target point. All creatures take damage unless they succeed in a Reflex save against the spell check DC, in which case they take half damage. The fireball is a flash explosion and typically does not cause humans to catch fire, but there is a 50% chance that highly flammable objects (such as dry cloth or paper) within the blast area may catch fire.",
    "sub_tables": [
      {
        "subtable_name": "Manifestation",
        "dice_size": "1d4",
        "table": {
          "1": "a flaming ball that catapults into the target and explodes in a fiery burst",
          "2": "a stream of liquid flame that douses the target in a raining cloud of fire",
          "3": "a singularity that appears at a point in space then explodes into a flowering burst of fire",
          "4": "a collection of spinning, whirling, fiery seeds that bounce forth to the target point, where they explode in flames"
        }
      },
      {
        "subtable_name": "Corruption",
        "dice_size": "1d8",
        "table": {
          "1": "caster’s hands and arms are blackened like charcoal",
          "2": "caster’s skin takes on a charcoal-like hue and texture",
          "3": "all hair on the caster’s body is burned off, and he is perpetually followed by a vague smell of burning hair",
          "4": "a small, invisible portal to the elemental plane of fire opens right above the caster and remains open, dripping globules of fire or lava around him on a regular basis; this manifests as sparkling lights around him at all times, and there is a 1% chance each day that a spark will light something on fire at an inopportune time",
          "5": "minor",
          "6": "major",
          "7": "greater"
        }
      },
      {
        "subtable_name": "Misfire",
        "dice_size": "1d5",
        "table": {
          "1": "a small fireball explodes on the caster, causing 1d6 damage to him",
          "2": "a large fireball explodes centered on the caster, causing 3d6 damage to him and all creatures within 20’",
          "3": "caster spontaneously combusts, taking 2d6 damage and causing all flammable objects on him (including clothes and scrolls) to instantaneously crumble to ash",
          "4": "caster summons the wrong element, generating a spray of ice that showers everything within 20’ of him, causing no damage but potentially dousing any existing flames",
          "5": "caster’s skin is badly sunburned across his entire body, and physical motion causes sharp pains (expressed as a -1 penalty to all physical actions) until the sunburn heals after one week"
        }
      },
      {
        "subtable_name": "Spell Results",
        "dice_size": "1d20",
        "table": {
          "1": "Lost, failure, and worse! Roll 1d6 modified by Luck: (0 or less) corruption + patron taint + misfire; (1-3) corruption; (4) patron taint (or corruption if no patron); (5+) misfire.",
          "2-11": "Lost. Failure.",
          "12-15": "Failure, but spell is not lost.",
          "16-17": "The caster launches a fireball up to 100’, doing 3d6 damage.",
          "18-21": "The caster launches a fireball up to 120’, doing 4d6 damage.",
          "22-23": "The caster launches a fireball that jumps to different targets 1d4+1 times. The first target must be within 50’, and that target takes 5d6 damage in an explosion of radius 20’. The fireball then skips to a second target that must be from 20’ to 50’ from the first target, and this second target takes 1d6 damage in a small explosion that only affects that single target. The second target must be at least 20’ away from the first target; this is the minimum 'skip' distance. If there is a third, fourth, or fifth target, it must be another 20’ away from the previous target, and it takes 1d6 damage. The fireball must skip the indicated number of times. If the caster runs out of targets, he can skip the fireball against inanimate objects.",
          "24-26": "The caster launches a fireball up to 160’, doing 6d6 damage. The fireball arcs up like a catapult to a maximum 40’ above ground at its peak. As such, it can curve around or over intermediate obstructions.",
          "27-31": "The caster launches a spray of small fireballs. There are three sprays of 1d3+1 fireballs each. Each spray can target the initial target and up to two additional targets (up to three targets in total). The targets can be up to 200’ away. Each mini-fireball does 1d6 damage and has no blast radius.",
          "32-33": "The caster launches a single fireball up to 200’, doing 10d6 damage. The caster can choose an area of effect ranging from a single human-sized target up to the full sphere of 20’ radius. The fireball arcs to a height of 40’ at its peak and can avoid intermediate objects.",
          "34-35": "The caster calls down a fireball from the heavens, targeting a point up to 500’ away and doing 14d6 damage. The caster can choose an area of effect ranging from a single human-sized target up to a sphere of 30’ radius. Instead of projecting from his fingertip, the fireball falls from above like a meteor strike, exploding in a fiery burst. The caster must have line-of-sight to his target, but he can cast around obstructions in this manner. For example, he may be able to view the target through a periscope or via a crystal ball of some kind.",
          "36+": "The caster launches a fireball at a target up to 1 mile away, doing 20d6 damage. The caster can choose an area of effect ranging from a single human-sized target up to a sphere of 40’ radius. The caster need not have line-of-sight to his target. He can choose a geographic point of which he has knowledge (such as a specific hill, tree, or room) or a target of which he has a physical trace (such as a lock of hair or fingernail). The fireball explodes at the designated point."
        }
      }
    ]
  }
  