{
    "table_name": "glorious-mire",
    "notes": "Level: 2 (Bobugbubilz) -- Range: Touch -- Duration: Varies -- Casting time: 1 round -- Save: None",
    "general": "The demon lord of amphibians is most comfortable in the endless swamplands of his home plane. These pits of briny mud extend endlessly toward a low brown horizon, entangled in roots and sunk amidst stiff gray plants and furry mildewed ruins. With this spell, the caster transforms his immediate surroundings into the swampland that Bobugbubilz calls home. Stone floors soften and change to mud, trees destabilize and wobble on their newly liquid foundation, and castles sink into the mire. At low levels the caster can affect only a small volume of space, but at high levels, this spell can bring down castles.",
    "sub_tables": [
      {
        "subtable_name": "Manifestation",
        "dice_size": "1d1",
        "table": {
          "1": "See below."
        }
      },
      {
        "subtable_name": "Spell Results",
        "dice_size": "1d20",
        "table": {
          "1": "Lost, failure, and patron taint.",
          "2-11": "Lost. Failure.",
          "12-13": "Failure, but spell is not lost.",
          "14-15": "The caster can transform a small space to swamp for 1d6 turns. He must touch the space to be affected. The space is equal to eight cubic feet or roughly the size of a human-sized door or a 2’ cube. Any mundane, non-living material can be affected (wood, stone, gold, dirt, etc.). The space changes into a semi-liquid muddy pool. If cast on a door, the door slides to the ground into a pool of gunk. If cast on a dungeon floor, the floor turns into a muddy pool a few inches deep. Living creatures are not affected, but their belongings (such as armor or a sword) can be. Magical items are not affected. At the end of the spell’s duration, the space reforms to its original dimensions and nature.",
          "16-19": "The caster can transform a medium-sized space to swamp for 1d6 turns. He must touch the space to be affected. The caster can affect a space equal to 250 square feet or roughly the size of a large boulder 10’ x 5’ x 5’. Any mundane, non-living material can be affected (wood, stone, gold, dirt, etc.). The space changes into a semi-liquid muddy pool. Living creatures are not transformed, but their belongings (such as armor or a sword) can be. Living creatures sitting or standing on the affected area sink into the mud as if they had been dropped into a swamp. Magical items are not affected. At the end of the spell’s duration, the space reforms to its original dimensions and nature.",
          "20-21": "The caster can transform a medium-sized space to swamp for 1d6 hours. He must touch the space to be affected. The caster can affect a space equal to 250 square feet or roughly the size of a large boulder 10’ x 5’ x 5’. Any mundane, non-living material can be affected (wood, stone, gold, dirt, etc.). The space changes into a semi-liquid muddy pool. If cast on a door, the door slides to the ground into a pool of gunk. If cast on a dungeon floor, the floor turns into a muddy pool a few inches deep. Living creatures are not transformed, but their belongings (such as armor or a sword) can be. Living creatures that were sitting or standing on the affected area sink into the mud as if they had been dropped into a swamp. If they are lightweight or can swim, there may be no impact, but heavily armored creatures may sink below the surface and drown. Magical items are not affected. At the end of the spell’s duration, the space reforms to its original dimensions and nature.",
          "22-25": "The caster can transform a large field into swamp for 1d6 days. The caster touches the point of origin, then guides the dimensions of the space to be affected. He must have line of sight to the edges of the space. The caster can define a space up to 100’ wide on each side, which is transformed into a swampy pool of mud, muck, and shallow water up to a few feet deep at various points. The field becomes difficult terrain. Lightly armored creatures move at half speed, but heavily armored warriors, as well as heavy creatures such as cows, horses, or minotaurs, become mired and unable to move. Some creatures may actually drown in the shallow water if they cannot be freed. Houses, battlements, and other fixed structures may sink several inches or more into the swamp. Magical items are not affected. At the end of the spell’s duration, the space reforms to its original consistency and nature, although objects that have sunk may now be partially underground. Alternately, the caster can affect a large solid mass up to the size of a large house. Only mundane, nonliving materials are affected (wood, stone, gold, dirt, etc.). The solid mass liquefies into a pile of mud and goo. The effect lasts for 1d6 days, at which point the object reforms to its original shape.",
          "26-29": "The caster can transform a large field into swamp permanently. The caster touches the point of origin, then guides the dimensions of the space to be affected. He must have line of sight to the edges of the space. The caster can define a space up to 100’ wide on each side, which is transformed into a swampy pool of mud, muck, and shallow water up to a few feet deep at various points. The field becomes difficult terrain. Lightly armored creatures move at half speed, but heavily armored warriors, as well as heavy creatures such as cows, horses, or minotaurs, become mired and unable to move. Some creatures may actually drown in the shallow water if they cannot be freed. Houses, battlements, and other fixed structures may sink several inches or more into the swamp. Magical items are not affected. At the end of the spell’s duration, the space reforms to its original consistency and nature, although objects that have sunk may now be partially underground. Alternately, the caster can affect a large solid mass up to the size of a large house, permanently. Only mundane, non-living materials are affected (wood, stone, gold, dirt, etc.). The solid mass liquefies into a pile of mud and goo.",
          "30-31": "The caster can permanently transform a vast expanse to swampy muck. The space is equal to up to 20,000 cubic feet or a field 200’ x 100’ to a depth of about a foot. This is also sufficient to affect a solid mass of almost 60’ x 60’ x 60’ or a large castle. The caster can also use the ability to create a pit of mud; i.e., a space 10’ wide at the very top and very deep. Heavy objects sink into the mud, armored humanoids may drown within it, and castles or houses can sink and be destroyed as their foundations shift. Magical items are not affected.",
          "32-33": "The caster can permanently transform a vast expanse to swampy muck or transform a single magic object permanently. If the caster transforms a vast expanse, the space is equal to up to 20,000 cubic feet or a field 200’ x 100’ to a depth of about a foot. This is also sufficient to affect a solid mass of almost 60’ x 60’ x 60’ or a large castle. The caster can also use the ability to create a pit of mud; i.e., a space 10’ wide at the very top and very deep. Heavy objects sink into the mud, armored humanoids may drown within it, and castles or houses can sink and be destroyed as their foundations shift. If the caster targets a magical item, he can target a single item up to human-sized (i.e., a sword, shield, staff, suit of armor, etc.), and that counts as the entire use of the spell. Magical objects receive a Fort saving throw to resist the effect. Otherwise, they are transformed to mud.",
          "34+": "The caster can permanently transform a vast expanse to swampy muck or transform a single magic object permanently or transform a single living creature to mud. If the caster transforms a vast expanse, the space is equal to up to 20,000 cubic feet or a field 200’ x 100’ to a depth of about a foot. This is also sufficient to affect a solid mass of almost 60’ x 60’ x 60’, or a large castle. The caster can also use the ability to create a pit of mud; i.e., a space 10’ wide at the very top and very deep. Heavy objects sink into the mud, armored humanoids may drown within it, and castles or houses can sink and be destroyed as their foundations shift. If the caster targets a magical item, he can target a single item up to human-sized (i.e., a sword, shield, staff, suit of armor, etc.) and that counts as the entire use of the spell. Magical objects receive a Fort saving throw to resist the effect. Otherwise, they are transformed to mud. If the caster targets a living creature, it must be touched to be affected. The living creature counts as the entire focus of the spell. Living creatures receive a Fort saving throw to resist the effect. Success indicates they are unaffected. Failure indicates they are transformed to mud and instantly slain."
        }
      }
    ]
  }
  