{
  "table_name": "locate-object",
  "notes": "Level: 2 -- Range: Varies -- Duration: 1 round or 1 hour -- Casting time: 1 round -- Save: N/A",
  "general": "This spell lets the caster locate an object. Weaker castings require a physical trace of the object, and it can only be located if it is on the same plane of existence. With more powerful castings, the caster can locate objects he has never beheld, even if they reside in a different plane or time.",
  "sub_tables": [
    {
      "subtable_name": "Manifestation",
      "dice_size": "1d1",
      "table": {
        "1": "N/A"
      }
    },
    {
      "subtable_name": "Corruption",
      "dice_size": "1d6",
      "table": {
        "1": "For the rest of his life, the caster constantly misplaces things, such that any time he goes to retrieve an object, there is a 10% chance he’s misplaced it",
        "2": "The caster’s eyes turn a deep purple color",
        "3": "The caster becomes a magnet for the object-obfuscating magic of other sorcerers, such that every day there is a 10% chance that a new, randomly-determined object appears on his person, and a separate 5% chance that the angry owner of a formerly-appeared object arrives to reclaim it",
        "4": "Minor",
        "5": "Minor",
        "6": "Major"
      }
    },
    {
      "subtable_name": "Misfire",
      "dice_size": "1d4",
      "table": {
        "1": "One randomly determined object on the caster’s person is transported 1d6x100 miles away, and the caster knows exactly where it is",
        "2": "Sometime in the next month the caster loses his favorite magic item and can’t find it no matter where he looks",
        "3": "The weapon of one randomly determined ally within 40’ disappears, only to reappear 1d7 days later a little worse for wear",
        "4": "The caster completely forgets all knowledge of the object he was going to locate"
      }
    },
    {
      "subtable_name": "Spell Results",
      "dice_size": "1d20",
      "table": {
        "1": "Lost, failure, and misfire.",
        "2-11": "Lost. Failure.",
        "12-13": "Failure, but spell is not lost.",
        "14-15": "The caster can attempt to locate a non-living, non-sentient thing, composed of metal, wood, cloth, or other mundane substances. The thing must be a specific object. For example, it cannot be 'any lantern' but must be a certain lantern of which the caster knows. The caster must have a physical trace of the object for which he searches. For example, if he attempts to find a lost horde of pirate gold, he must have one gold piece from the horde; if he searches for a magic sword, he must have a suit of armor scored by the sword. Full concentration is required to cast the spell. If the object is within 100’ of the caster and on the same plane of existence, he receives a sense of the direction in which it lays. This directional sense is three-dimensional, so an object on a lower level of a dungeon could produce a downward sense of direction.",
        "16-19": "The caster can attempt to locate a non-living, non-sentient thing, composed of metal, wood, cloth, or other mundane substances. The thing must be a specific object. For example, it cannot be 'any lantern' but must be a certain lantern of which the caster knows. The caster must have a physical trace of the object for which he searches. For example, if he attempts to find a lost horde of pirate gold, he must have one gold piece from the horde; if he searches for a magic sword, he must have a suit of armor scored by the sword. Full concentration is required to cast the spell. If the object is within range of the caster and on the same plane of existence, he receives a sense of the direction in which it lays. This directional sense is three-dimensional, so an object on a lower level of a dungeon could produce a downward sense of direction. Range is increased with each round of full concentration, as follows: round 1 = 100’, round 2 = 500’, round 3 = half a mile, round 4 = 1 mile, round 5 = 2 miles, round 6 = 5 miles, round 7 = 10 miles. The range does not go beyond 10 miles. The sense of location includes only direction, not distance, and exists only as of the moment in time when the spell was cast.",
        "20-21": "The caster can attempt to locate a non-living, non-sentient thing, composed of metal, wood, cloth, or other mundane substances. The thing must be a specific object. For example, it cannot be 'any lantern' but must be a certain lantern of which the caster knows. The caster must have a physical trace of the object for which he searches. For example, if he attempts to find a lost horde of pirate gold, he must have one gold piece from the horde; if he searches for a magic sword, he must have a suit of armor scored by the sword. Full concentration is required to cast the spell. If the object is within range of the caster and on the same plane of existence, he receives a sense of the direction in which it lays. This directional sense is three-dimensional, so an object on a lower level of a dungeon could produce a downward sense of direction. Range is increased with each round of full concentration, as follows: round 1 = 100’, round 2 = 500’, round 3 = half a mile, round 4 = 1 mile, round 5 = 2 miles, round 6 = 5 miles, round 7 = 10 miles. The range does not go beyond 10 miles. The sense of location includes direction and a very approximate sense of distance accurate to within 25%; this directional sense exists only as of the moment in time when the spell was cast.",
        "22-25": "The caster can attempt to locate a non-living, non-sentient thing, composed of metal, wood, cloth, or other mundane substances. The thing must be a specific object. For example, it cannot be 'any lantern' but must be a certain lantern of which the caster knows. The caster does not need a physical trace of the object for which he searches, but he must have specific knowledge of the object. For example, he must have beheld it in the past, read accounts of it, or heard tell of it. Provided he can give an accurate description of the object, the spell will return the location of an object matching his description, if it is in range. Full concentration is required to cast the spell. If the object is within range of the caster and on the same plane of existence, he receives a sense of the direction in which it lays. This directional sense is three-dimensional, so an object on a lower level of a dungeon could produce a downward sense of direction. Range is increased with each round of full concentration, as follows: round 1 = 100’, round 2 = 500’, round 3 = half a mile, round 4 = 1 mile, round 5 = 2 miles, round 6 = 5 miles, round 7 = 10 miles. The range does not go beyond 10 miles. The sense of location includes direction and a very approximate sense of distance accurate to within 25%. The spell’s duration is a full hour. At any point during that duration, the caster can spend a full round concentrating and receive a new “ping” on the direction and distance of the object. A lapse in concentration during the duration does not cancel the spell; the caster must simply re-establish concentration.",
        "26-29": "The caster can attempt to locate a non-living, non-sentient thing, composed of metal, wood, cloth, or other mundane substances. The thing must be a specific object. For example, it cannot be 'any lantern' but must be a certain lantern of which the caster knows. The caster does not need a physical trace of the object for which he searches, but he must have specific knowledge of the object. For example, he must have beheld it in the past, read accounts of it, or heard tell of it. Provided he can give an accurate description of the object, the spell will return the location of an object matching his description, if it is in range. Full concentration is required to cast the spell. If the object is within range of the caster and on the same plane of existence, he receives a sense of the direction in which it lays. This directional sense is three-dimensional, so an object on a lower level of a dungeon could produce a downward sense of direction. Range is increased with each round of full concentration, as follows: round 1 = 100’, round 2 = 500’, round 3 = half a mile, round 4 = 1 mile, round 5 = 2 miles, round 6 = 5 miles, round 7 = 10 miles. The range does not go beyond 10 miles. The sense of location includes direction and a very approximate sense of distance accurate to within 25%. The spell’s duration is a full hour. At any point during that duration, the caster can spend a full round concentrating and receive a new “ping” on the direction and distance of the object. A lapse in concentration during the duration does not cancel the spell; the caster must simply re-establish concentration.",
        "30-31": "The caster can attempt to locate a non-living, non-sentient thing. The thing need not be a specific object. The caster could choose to look for 'any lantern' or a specific lantern he knows, or he could even look 'for any water' or 'for the nearest exit.' The caster does not need a physical trace of the object for which he searches, nor does he need any specific knowledge of it. However, the more vague his description the greater the chance the spell will reveal an inaccurate read (at judge’s discretion). Full concentration is required to cast the spell. If the object is within range of the caster and on the same plane of existence, he receives a sense of the direction in which it lays. This directional sense is three-dimensional, so an object on a lower level of a dungeon could produce a downward sense of direction. Range is increased with each round of full concentration, as follows: round 1 = half-mile, round 2 = 1 mile, round 3 = 5 miles, round 4 = 10 miles, round 5 = 50 miles, round 6 = 250 miles, round 7 = 1,000 miles. The range does not go beyond 1,000 miles. The sense of location includes direction and a very approximate sense of distance accurate to within 25%. The spell’s duration is a full hour. At any point during that duration, the caster can spend a full round concentrating and receive a new “ping” on the direction and distance of the object. A lapse in concentration during the duration does not cancel the spell; the caster must simply re-establish concentration.",
        "32-33": "The caster can attempt to locate a non-living, non-sentient thing, even if it is on another plane. The thing need not be a specific object. The caster could choose to look for 'any lantern' or a specific lantern he knows, or he could even look 'for any water' or 'for the nearest exit.' The caster does not need a physical trace of the object for which he searches nor does he need any specific knowledge of it. However, the more vague his description the greater the chance that the spell will reveal an inaccurate read (at judge’s discretion). Full concentration is required to cast the spell. If the object is within range of the caster, he receives a sense of the direction in which it lays. This directional sense is three-dimensional, so an object on a lower level of a dungeon could produce a downward sense of direction. Range is increased with each round of full concentration, as follows: round 1 = half-mile, round 2 = 1 mile, round 3 = 5 miles, round 4 = 10 miles, round 5 = 50 miles, round 6 = 250 miles, round 7 = 1,000 miles. After concentrating for seven rounds, on the eighth round the caster will know if the object is on a different plane. On the ninth round, he will have a sense of what plane that is. If he has visited that plane before, he will know specifically; if he has never visited, he will have a greater or lesser sense of which plane it is, depending on his knowledge of the planes. Knowledge that the object is on another plane does not reveal direction or distance. If the item is on the same plane, the sense of location includes direction and a very approximate sense of distance accurate to within 25%. The spell’s duration is a full day. At any point during that duration, the caster can spend a full round concentrating and receive a new “ping” on the direction and distance of the object. A lapse in concentration during the duration does not cancel the spell; the caster must simply re-establish concentration.",
        "34+": "The caster can attempt to locate any thing, whether living or non-sentient, specific or general, even if it is on another plane. The thing need not be a specific object. The caster could choose to look for 'any lantern' or a specific lantern he knows, or he could even look 'for any water' or 'for the nearest exit.' The caster does not need a physical trace of the object for which he searches nor does he need any specific knowledge of it. However, the more vague his description the greater the chance that the spell will reveal an inaccurate read (at judge’s discretion). Full concentration is required to cast the spell. If the object is within range of the caster, he receives a sense of the direction in which it lays. This directional sense is three-dimensional, so an object on a lower level of a dungeon could produce a downward sense of direction. If the object is anywhere on the current plane of existence, the caster knows in the first round; if it is on a different plane, he knows the plane’s identity on the second round; and on the third round, he knows the object’s exact location on its plane of existence. The spell’s duration is a full month. At any point during that duration, the caster can simply concentrate for one round to receive a new “ping” on the direction and distance of the object. A lapse in concentration during the duration does not cancel the spell; the caster must simply re-establish concentration."
      }
    }
  ]
}
