{
    "table_name": "lotus-stare",
    "notes": "Level: 2 -- Range: Sight -- Duration: 1 round or more -- Casting time: 1 round -- Save: Will vs. spell check DC",
    "general": "The cleric hypnotizes a target with the incomprehensible depths of the lotus stare.",
    "sub_tables": [
      {
        "subtable_name": "Manifestation",
        "dice_size": "1d3",
        "table": {
          "1": "The cleric’s eyes swirl in a kaleidoscopic blur of light and dark. The eyes of affected targets swirl in the same manner.",
          "2": "A brilliant flash of light surrounds the cleric’s eyes, and the same effect ripples across the eyes of the affected targets.",
          "3": "The cleric’s pupils contract rapidly, causing a radiant pulse of energy to shoot out and envelop the target’s eyes."
        }
      },
      {
        "subtable_name": "Spell Results",
        "dice_size": "1d20",
        "table": {
          "1-13": "Failure.",
          "14-15": "Making eye contact with one target, the cleric forces it to stare into the swirling hypnotics of his gaze. The target receives a Will save. If it fails, then as long as the cleric concentrates fully and maintains eye contact, the creature is held immobile and cannot take any action. If eye contact is broken – either voluntarily by the cleric or because the target is severely jostled, blindfolded, or otherwise removed from the cleric’s sight – then the target regains its senses and can act as normal.",
          "16-19": "Making brief eye contact with one target, the cleric forces it to stare into the swirling hypnotics of his gaze. The target receives a Will save. If it fails, then the cleric can break contact and the target remains hypnotized for 1d6+CL rounds or until the hypnosis is broken. An attack or other physical trauma (including a vigorous shaking by an ally) will break the hypnosis. While the target is hypnotized, it acts on commands issued by the cleric, although it performs them as if a drugged zombie, moving at half-speed and taking a -2 penalty to all actions. The commands can be of any type, even those that are self-destructive. The target is considered to have animal-level intelligence while affected, so its ability to execute complex instructions (or cast spells, if it is a spellcaster) will be inhibited.",
          "20-21": "Making brief eye contact with one target, the cleric forces it to stare into the swirling hypnotics of his gaze. The target receives a Will save. If it fails, then the cleric can break contact and the target remains hypnotized for 2d6+CL rounds. The hypnosis cannot be broken by physical means (i.e., an attack or jostling). While the target is hypnotized, it acts on commands issued by the cleric, although it performs them as if a drugged zombie, moving at half-speed and taking a -2 penalty to all actions. The commands can be of any type, even those that are self-destructive. The target is considered to have animal-level intelligence while affected, so its ability to execute complex instructions (or cast spells, if it is a spellcaster) will be inhibited.",
          "22-25": "Making brief eye contact with one target, the cleric forces it to stare into the swirling hypnotics of his gaze. The target receives a Will save. If it fails, then the cleric can break contact and the target remains hypnotized for 1d4+CL days. The hypnosis cannot be broken by physical means (i.e., an attack or jostling). While the target is hypnotized, it acts on commands issued by the cleric, although it performs them as if a drugged zombie, moving at half-speed and taking a -2 penalty to all actions. The commands can be of any type, even those that are self-destructive for the target. The target is considered to have animal-level intelligence while affected, so its ability to execute complex instructions (or cast spells, if it is a spellcaster) will be inhibited. The target receives a fresh Will save each day to end the effect before the spell’s duration expires.",
          "26-29": "Making brief eye contact with multiple targets, the cleric forces them to stare into the swirling hypnotics of his gaze. The cleric can affect up to 10 targets in a “gaze cone” up to 40’ long and 40’ wide at its endpoint. The targets receive a Will save. For any target that fails, the cleric can break contact and the target remains hypnotized for 1d8+CL days. The hypnosis cannot be broken by physical means (i.e., an attack or jostling). While the target is hypnotized, it acts on commands issued by the cleric, although it performs them as if a drugged zombie, moving at half-speed and taking a -2 penalty to all actions. The commands can be of any type, even those that are self-destructive. The target is considered to have animal-level intelligence while affected, so its ability to execute complex instructions (or cast spells, if it is a spellcaster) will be inhibited. The target receives a fresh Will save each day to end the effect before the spell’s duration expires.",
          "30-31": "Making brief eye contact with multiple targets, the cleric forces them to stare into the swirling hypnotics of his gaze. The cleric can affect up to 10 targets in a “gaze cone” up to 40’ long and 40’ wide at its endpoint. The targets receive a Will save. For any target that fails, the cleric can break contact and the target remains hypnotized for 1d8+CL weeks. The hypnosis cannot be broken by physical means (i.e., an attack or jostling). While the target is hypnotized, it acts on commands issued by the cleric, although it performs them as if a drugged zombie, moving at half-speed and taking a -2 penalty to all actions. The commands can be of any type, even those that are self-destructive. The target is considered to have animal-level intelligence while affected, so its ability to execute complex instructions (or cast spells, if it is a spellcaster) will be inhibited. The target receives a fresh Will save each day to end the effect before the spell’s duration expires.",
          "32-33": "Making brief eye contact with multiple targets, the cleric forces them to stare into the swirling hypnotics of his gaze. The cleric can affect up to 20 targets in a “gaze cone” up to 80’ long and 80’ wide at its endpoint. The targets receive a Will save. For any target that fails, the cleric can break contact and the target remains hypnotized for 1d8+CL weeks. The hypnosis cannot be broken by physical means (i.e., an attack or jostling). While the target is hypnotized, it acts on commands issued by the cleric to the best of its normal, non-hypnotized ability. Targets move at normal speed and take no penalties to their actions while hypnotized. They retain their normal intelligence and can cast spells as normal (if applicable). However, they are still obviously hypnotized, for their eyes swirl with the strange patterns of the lotus. The target receives a fresh Will save each week to end the effect before the spell’s duration expires.",
          "34+": "Making brief eye contact with multiple targets, the cleric forces them to stare into the swirling hypnotics of his gaze. The cleric can affect all targets in a “gaze cone” up to 80’ long and 80’ wide at its endpoint. Creatures of 2 HD or less are automatically affected; other targets receive a Will save. For affected targets, the cleric can break contact and the target remains hypnotized for 1d8+CL weeks. The hypnosis cannot be broken by physical means (i.e., an attack or jostling). While the target is hypnotized, it acts on commands issued by the cleric to the best of its normal, non-hypnotized ability. Targets move at normal speed and take no penalties to their actions while hypnotized. They retain their normal intelligence and can cast spells as normal (if applicable). However, they are still obviously hypnotized, for their eyes swirl with the strange patterns of the lotus. The target receives a fresh Will save each week to end the effect before the spell’s duration expires."
        }
      }
    ]
  }
  