{
    "table_name": "Mercurial Magic",
    "notes": "",
    "general": "",
    "sub_tables": [
        {
            "subtable_name": "Results",
            "dice_size": "1d100",
            "table": {
                "1": "At great cost. Every time the wizard casts the spell, someone he knows dies (judge’s choice).",
                "2": "Extremely difficult to cast. Instead of rolling as normal on a spell check, the wizard rolls a die type reduced by two steps on the dice chain (e.g., if he normally rolls 1d20, he now rolls 1d14).",
                "3": "Soul dedication. In order to cast the spell, the wizard must either dedicate the soul of the target to his patron or the soul of a creature with hit dice equal to that of the target. If the caster fails to claim the soul for his patron, the spell cannot be recast until the patron is appeased.",
                "4": "Health bane. Casting this spell always temporarily reduces the wizard’s Stamina by 1d3 points. This ability loss is in addition to any spellburn and is deducted before spellburn occurs.",
                "5": "Difficult to cast. Instead of rolling as normal on a spell check, the wizard rolls a reduced die (based on the dice chain; i.e., d20 becomes d16).",
                "6": "Counter-magic bubble. In the round following the casting of this spell, all other spells (including the wizard’s own) cast within 100’ suffer a -4 penalty to spell checks.",
                "7": "Luck distortion. For 1d4 rounds following the spell, the wizard suffers a -2 penalty to all rolls.",
                "8": "Count of ten. Each time the wizard casts this spell, one of his fingers (or toes at the judge’s discretion) melts away. For every two digits lost, he suffers a permanent -1 penalty to Agility. The digits can be replaced by magic, but if the wizard ever runs out of them, he cannot cast this spell.",
                "9": "Anima drain. The wizard suffers corruption every time he casts the spell, regardless of spell check, unless he spellburns.",
                "10": "Blood magic. The power of this spell is partially drawn from spilled blood, a sacrifice to the unknowable lords of Magic. A living creature with hit points equal to or greater than the spell’s level must be offered up before the spell is cast; otherwise, the spell check suffers a -4 penalty or patron taint (judge’s choice). The creature need not be sentient; chickens, goats, and other simple animals with the proper amount of hit points will suffice.",
                "11": "Planar rift. Casting the spell tears jagged hole in the warp and weft of the multiverse. There is a cumulative 1% chance that a horror from the outer dark steps through the rift. The fearsome creature has HD equal to the caster’s level + 5. Roll 1d3: (1) the monster steals the spell from the PC’s mind before vanishing forever; (2) the monster attacks the PC with the intent to slay the caster; (3) the monster seeks to strike a bargain with the caster, offering the PC forbidden knowledge (judge’s choice) in exchange for the souls of the caster’s party.",
                "12": "Magical reverb. For 1d4 rounds after the spell is cast, a backwash of eldritch energy passes over the wizard. Any spell checks the wizard makes during that time suffer a -4 penalty.",
                "13": "Slow cast. The spell requires twice the normal time to cast.",
                "14": "Sleep of ages. After casting this spell, the wizard must make a Fort save (DC 5 + the spell’s level) or fall into a deep sleep for 1 day for each level of the spell. He cannot be awakened by any mundane or magical means during this time.",
                "15": "Material magic. The spell requires the caster to possess an uncommon substance or item to power its magic, beyond the normal components. This material component is determined by the judge and its rarity should be indicative of the spell’s power. The object or item is consumed by a successful casting.",
                "16": "Primordial channel. Memories from before the time of Man flood the caster’s mind as he takes on a primitive demeanor. Every time he casts this spell, the wizard devolves to sub-human tendencies for 1d4 rounds thereafter. During this time, he cannot speak intelligently, cannot cast other spells, cannot use complex devices, cannot read or write, etc.",
                "17": "Stolen knowledge. The formula for the spell was stolen from a powerful extraplanar being. Each time the spell is cast there is a 1% chance per spell level that the being emerges to take back its occult knowledge… the hard way. Roll 1d7: (1) Grand Sultan of the Efreet; (2) the great Cthulhu; (3) a Grand Prince of Hell; (4) an elephant-faced godling of the Outer Dark; (5) the spirit of a long dead archmage; (6) a mechanized brain from the distant future; (7) an elemental prince.",
                "18": "Vermin attractor. The spell attracts a swarm of bothersome insects to the caster’s location that arrive 1d4 rounds after the spell is completed. These insects mill about the caster, biting for 1 point of damage and causing the caster to suffer a -1 penalty to all saving throws, initiative rolls, and spell checks for 1d10 rounds or until he takes adequate measures to disperse or escape the swarm.",
                "19": "Siphon magic. Casting this spell has a 50% chance of causing the caster or another nearby person to forget a spell of equal level for the day as if they had failed a spell check. If it is determined that a spell caster loses a spell, there is a 3 in 4 chance it is the wizard himself and a 1 in 4 chance it affects the next closest spell caster. If the affected spell caster does not have a spell of the appropriate level, he takes damage equal 1d6 + the spell’s level.",
                "20": "Rush of wind. A great rush of wind occurs every time the spell is cast, originating from the caster toward his target. Torches flicker and may go out (50% chance).",
                "21": "Corrosion touch. The casting of this spell causes a randomly determined item of steel or iron to corrode and pit in a 15’ radius around the caster. The item corroded by the casting is always of dagger-size or larger and chosen at random. If the wizard voluntarily holds or touches a metal item of the appropriate size while casting, that object is destroyed and no other.",
                "22": "Sympathetic magic. The spell requires that the caster have a personal belonging or a physical piece of its target in order to function normally. The spell can be cast without this sympathetic connection, but the wizard suffers a -4 penalty to his spell check.",
                "23": "Cannibal magic. The caster suffers damage equal to 1d4+the spell’s level each time he casts it, unless he is physically touching another individual willing to suffer the damage in his stead. Unwilling or unknowing individuals cannot be forced to suffer for the wizard.",
                "24": "Prismatic distortion. Nearby light is distorted. Roll 1d6: (1) area within 20’ darkens to shadow; (2) all light sources (torches, lanterns, etc.) within 20’ are extinguished magically; (3) incandescent flash upon completion of spell; (4) all colors are drained from within 20’ of wizard for 1d4 rounds; (5) light takes on a green/orange/blue/yellow hue for 1d4 rounds; (6) shadows multiply from different directions, as if there were additional, invisible light sources, for 1d4 rounds after completion.",
                "25": "Terror-inducing. Casting the spell inspires terror in animals and creatures with an Intelligence score of 3 or less. All such creatures within 50’ flee the caster as quickly as possible for 1d14 rounds. If restrained, the animals panic, insensate to all commands. The caster’s familiar, if any, is immune.",
                "26": "Auditory feedback. Spell is always associated with unusual sounds. Roll 1d6: (1) crack of thunder, (2) loud buzzing, (3) faint whispers; (4) rush of water; (5) roaring of animals; (6) wailing of bereavement.",
                "27": "No range. The spell has no range, and can only be cast by touching the target. If the spell normally has a range of only touch, it can only be cast exactly 10 feet away from the target.",
                "28": "Odd growths. Strange growths appear in immediate area whenever spell is cast. Roll 1d6: (1) toadstools; (2) pools of slime; (3) flowers; (4) black fungus; (5) crystals; (6) fields of wheat.",
                "29": "Fear and loathing. The caster’s forbidden knowledge inspires fearsome antipathy in intelligent beings. Friendly allies are immune, but all others are affected as follows: those of half the caster’s HD or less must make a morale check or flee, those of greater HD focus all their attacks on the caster.",
                "30": "Memories of a dying god. Casting the spell accesses the memories of a dying god. The caster must succeed on a DC 13 Will save or be overcome by hallucinations of a bloody god-war that last 1d3 rounds. If the caster ever succeeds on the Will save with a natural 20, he triumphs over the god and is never troubled by the hallucinations again. Once dispelled, all future spell checks for this spell are made with 1d24.",
                "31": "Unwanted attention. Casting the spell draws the attention of a powerful supernatural being, who watches the wizard for 10 minutes. Roll 1d4: (1) a bloodshot eye opens on the wizard’s forehead, seeing everything the wizard sees; (2) a small animal (crow, frog, cat, etc.) appears and follows the wizard around; (3) the wizard and his allies feel as if something huge and terrible is standing right behind them; (4) an agent of the supernatural being appears and interrogates the wizard on his use of the spell.",
                "32": "Circumstantial magic. The wizard can only cast this spell under specific environmental or personal conditions. Roll 1d10 to determine the condition: (1) in the dark of night; (2) under the brightness of the sun; (3) while immersed in water; (4) while intoxicated; (5) after fasting for 24 hours; (6) underground; (7) during the cold of winter; (8) while naked; (9) from an elevated position; (10) when reduced to 50% or less of total hit points.",
                "33": "Hairy magic. The wizard’s head hair (hair, beard, eyebrows, ear hair, etc.) grows 1” each time this spell is cast.",
                "34": "Thunderstruck. A clap of thunder and flash of heat lightning accompanies the casting of this spell, revealing the wizard’s position to all within sight of him. This likely draws both attention and arrows.",
                "35": "Joe Average. Instead of a d20, the caster rolls 2d10 for spell checks on this spell. If his check die is another type, he rolls two “half-dice” instead (i.e., 2d7 instead of 1d14, 2d8 instead of 1d16, etc.).",
                "36": "Demonic voice. The words of the spell are in a demonic tongue unknown to mortals. A demon is compelled/allowed to speak the spell through the wizard’s own throat. The strain of channeling the unnatural voice leaves the wizard unable to speak for 1d4 rounds after the spell has been cast.",
                "37": "Aura of decay. The spell drains the physical form of all material of a certain type within 20 feet of the caster, causing it to age quickly. Roll 1d6: (1) metal tarnishes and spots of rust appear on it; (2) wood dries out, becoming brittle and cracked; (3) stone becomes smooth and worn, with small cracks appearing in it; (4) fabrics and leathers fray and tear; (5) food and drink spoils; (6) flesh ages and all creatures within the effect age one year.",
                "38": "Whimsical patron. The spell draws upon the wizard’s patron to succeed, but this entity’s attentions are notoriously fickle. Whenever this spell is cast, roll 1d6 to determine what die is used whenever this spell is cast: (1-2) d16; (3-4) d20; (5) d24; (6) d30. This d6 roll supersedes the wizard’s normal action die and the dice chain.",
                "39": "Blood sweat. Casting the spell causes blood to ooze from the wizard’s pores. No damage is inflicted, but the wizard looks a gory mess. At the judge’s discretion, this may also attract predators.",
                "40": "Ravenous. The wizard becomes ravenously hungry after casting the spell. Hungry people are often cranky, so the wizard suffers a -2 Personality until he is able to eat.",
                "41-60": "No change. The spell manifests as standard.",
                "61": "Loud enough for you? Due to the ineffable demands of magic, this spell must be shouted when cast, effectively negating any chance of the caster remaining undetected before the casting is completed.",
                "62": "Gender bender. Casting the spell causes the wizard to temporarily transform into the opposite gender. This sex change remains in effect for one hour per level of the spell. Recasting the spell shifts the caster back into his original sex, but a failure on the spell check causes the wizard to remain as the shifted gender until a full 24 hours have passed.",
                "63": "Diurnal/nocturnal magic. The spell’s power is tied to either night or day. During the ascendant period, the wizard rolls 1d24 for spell checks; during the descendent hours he rolls 1d16. If the wizard’s spell check does not use a 1d20, roll an appropriately higher and lower die according to the dice chain.",
                "64": "Wealful/woeful magic. Each time this spell is cast, there is a random 10%-60% chance that the wizard’s Luck score is altered by its magic. If the wizard’s Luck is affected, it is either raised 1d3 points (50% chance) or lowered 1d3 points (50% chance).",
                "65": "Casting circle. The spell’s power can be amplified with the assistance of other wizards. For each wizard present and willing to assist the caster, the casting wizard gets a +1 modifier to his spell check. Assisting in spell casting does not require knowledge of the spell, but the assistant mages can perform no other action until the spell is cast.",
                "66": "Accidental alchemist. Each time the spell is cast, one random item within 20 feet of the caster is turned to lead and another is turned to gold. Both objects probably weigh more than they previously did, and the gold object is worth twice its normal cost or 1gp, whichever is more.",
                "67": "St. Gygakk’s fire. Casting this spell results in the wizard being limned by flickering chartreuse fire for 1d4 rounds, granting opponents a +2 bonus to attacks against the caster. It also negates any concealment and invisibility enjoyed by the caster, but does provide a faint illumination to the area immediately surrounding the wizard.",
                "68": "Mirror magic. This spell causes an eldritch echo that duplicates the wizard’s appearance as if he had cast a mirror image spell with a spell check of 16-19. However, each duplicate image created saps the caster of a single point of Personality until the image is dispersed.",
                "69": "Skeletal caster. The wizard’s skin and internal organs become transparent for 1d4 rounds after casting this spell, making him appear as a clothed skeleton. Although likely to be mistaken as an un-dead, the wizard also enjoys a +2 bonus to his AC against missile attacks.",
                "70": "Temporal echo. Each time the wizard casts this spell, he predicts the numerical result of his spell check roll. If he rolls this number exactly, the spell automatically re-casts itself each round for 1d3 rounds. The predicted result must be a successful spell check; predicting a failed result has no effect.",
                "71": "Worms of the earth. Pale white worms crawl forth from the earth whenever the wizard casts this spell, writhing in fiery agony (or unholy delight) before expiring on the open ground. Easily crushed underfoot, the worms disintegrate into greasy ash after 1d6 rounds.",
                "72": "Chain casting. Each successive casting of the spell grants a +1 bonus to wizard’s spell check, up to a total bonus equal to the caster’s Int or Luck modifier (whichever is higher). If the wizard casts another spell, he breaks the chain, resetting the modifier back to +0.",
                "73": "Karmic casting. Before making the spell check, the wizard can choose to add or subtract 1d5 from the roll. If the caster adds 1d5, the next time he casts the spell he must subtract 1d5, and vice versa. After two castings, the karma is reset, and the wizard again gets to choose what modifier to use, if any.",
                "74": "Tide of ash. All living vegetative matter within 10’ per spell level is reduced to ash. Vegetative creatures caught within this radius take 1d14 points of damage per spell level. Dead vegetative matter is unaffected.",
                "75": "Spell by proxy. The wizard can choose another person or object to deliver this spell in his stead. He must first touch the proxy and then cast the spell, which does not take effect at that time. The proxy releases the spell a number of rounds later equal to 1d4+the spell’s level. Non-intelligent proxies automatically release the spell at this time; intelligent proxies can release it at will at any point prior to the time indicated.",
                "76": "Silenced. At his discretion, the wizard is able to cast the spell silently. He need not speak, and any auditory effects of the spell can be suppressed.",
                "77": "Call of the Outer Dark. Strange chimes scream in the air and foreign stars waver above the wizard. All looking at the caster must make DC 10 Will saves or be entranced for 1d3 rounds. Attacking entranced characters instantly frees them from their enchantment.",
                "78": "Mentalism. The wizard can cast the spell using ESP alone. He need not move, speak, breathe, or use any material ingredients to invoke the effects.",
                "79": "Plague of rats. Thousands of rats, mice, moles and voles pour from the caster’s sleeves, robes and pockets, scattering in every direction. Physical attacks against the caster are softened by 1d4 points of damage, the blow cushioned by the squealing tide of rodents.",
                "80": "Dimensional schism. By casting the spell, the wizard hurls himself into the warp of multiple realities. 1d7+1 duplicates of the caster appear, identical in nearly every respect, but each drawn from its own parallel universe. Attacks against the caster are randomly assigned across the doppelgangers. The doppelgangers remain for 1 round per spell level. There is a 1% chance per spell level that the original caster vanishes into one of the alternate realities, replaced by a nearly identical incarnation of opposite alignment and patron.",
                "81": "Terrible to behold. The wizard becomes fearsome when casting the spell. Roll 1d6: (1) he appears to grow in size; (2) he takes on a horrid expression; (3) he glows a fiery red; (4) his body is shadowed while his face is brightly lit; (5) the aspect of his patron towers above him; (6) the wind whirls around him.",
                "82": "Spell killer. Casting the spell steals energy from a dying world, and any use of the spell causes the death of untold thousands. Every night following a casting of the spell, the wizard is haunted by dream-communications from an ancient sorcerer-king desperate to save his people.",
                "83": "Blue star. A blue, seven-pointed star flares brightly on the wizard’s forehead each time the spell is cast. The star casts a circle of glaring light 25’ in diameter per spell level.",
                "84": "Energy burst. When successfully casting this spell, the wizard is surrounded by a burst of energy. Roll 1d6: (1) wreathes of flame, which do not affect the wizard but ignite flammable objects within 5’ and cause 1d6 damage to melee opponents; (2) crackles of electricity, which arc to the nearest enemy within 10’ and cause 1d6 damage; (3) aura of frost, which causes 1d4 cold damage to everything within 10’ and automatically snuff torches and lanterns in range; (4) cloud of ash, which the wizard can see through but obscures the sight of all others within 5’; (5-6) instead of determining effect at time of spell acquisition, roll 1d4 each time the spell is cast and compare to above results.",
                "85": "Psychic shield. In the round immediately following the casting of this spell, the wizard gains a +2 bonus to his AC and any Will saves, as he is encased in a protective barrier of psychic energy. It disperses the following round.",
                "86": "Mystic twin. Casting the spell causes a fully functioning twin face to appear in the caster’s chest. The face remains for 1d3 rounds. During that time, this dual face has its own 1d20 action die under the control of the player, with which it can speak, cast spells as the caster, or spout cryptic wisdom.",
                "87": "Planar blink. After casting the spell, the caster unpredictably blinks in and out of this plane of existence, granting a +4 bonus to the wizard’s AC at cost of a -4 penalty to all the wizard’s attacks. The effect lasts for 1 round per spell level. There is a 1% chance per spell level that the wizard does not return from his involuntary jaunt across the cosmos.",
                "88": "Rain of frogs. Casting this spell sparks a tempest of amphibians that fall in a 30’ diameter centered on the caster. All within that area must make a Ref and Fort save (DC 10+caster’s Int modifier). Failing the Reflex save indicates the character slips on a frog and falls prone; failing the Fort save means the character has been hit by large batrachians for 1d3 points of damage.",
                "89": "Phase out. After casting this spell, the wizard shifts out of phase with the world, making him invisible and invulnerable to attack but preventing him from interacting with his environment. This state lasts for 1d6 rounds +1 round per level of the spell.",
                "90": "Weatherman. Casting the spell upsets local weather patterns. Roll 1d7: (1) drought: no rain or moisture falls on the land for 1d12 years; (2) bitter winter sweeps over the land for 1d3 years; (3) incessant rain douses the land for 1d20 weeks; (4) a freak lightning storm hammers the area for 1d100 hours; (5) hurricane-like wind scours the earth for 1d7 weeks; (6) a localized eclipse blots out the sun for 1d20 days; (7) no stars are seen in the sky for 1d100 years. The area of effect is up to the judge’s determination.",
                "91": "Breath of life. Casting this spell imbues the caster and those around him with beneficial energies. All within 15’ of the caster (both friend and foe) are healed 1d6 points of damage for every level of the spell (i.e., a level 3 spell heals 3d6 damage).",
                "92": "Gibbering allies. Chittering, mephitic, rat-sized demons scurry forth from the wizard’s pockets and sleeves, scattering around him in a scratching fury. They attack enemies within 10’ (atk +2, 1d4 dmg) and aid the spell as appropriate before dissipating in a cloud of ash after 1 minute.",
                "93": "Greater power. The caster is allowed to roll twice for any random element of the spell (duration, damage, number affected, etc.) and take whichever result he wishes.",
                "94": "Fine control. The wizard is adept at reigning in the magical energies of the spell and can choose any result on the spell chart equal to or lower than the one rolled.",
                "95": "Psychic focus. Casting this spell clears the caster’s mind and prepares him to channel further energy. For 1d4 rounds after the spell is cast, the wizard receives a +4 bonus to other spell checks. This effect does not stack with itself.",
                "96": "Powerful caster. Instead of rolling as normal on a spell check, the wizard rolls a die improved by one step on the dice chain (e.g., d20 becomes d24).",
                "97": "Necrotic drain. The spell is powered by the energies of the living. The nearest creature (other than the caster) takes 1d6 hp of damage per spell level. For every 2 hp lost, the spell check result is increased by +1.",
                "98": "Natural-born talent. Instead of rolling as normal on a spell check, the wizard rolls a die type improved by two steps on the dice chain (e.g., if he normally rolls 1d20, he now rolls 1d30).",
                "99": "Roll again twice.",
                "100": "Roll again twice, but instead of rolling d%, roll 4d20 modified by the wizard’s Luck adjustment (in increments of 10%)."
            }
        }
    ]
}
