{
    "table_name": "phantasm",
    "notes": "Level: 2 -- Range: 100’ or more -- Duration: 1 round or longer, with concentration -- Casting time: 1 round -- Save: Will vs. spell check DC",
    "general": "With this spell, the caster creates a simple illusion. The illusion is strictly visual, with no aural, tactile, or olfactory components. With concentration, the caster can manipulate the illusion.",
    "sub_tables": [
      {
        "subtable_name": "Manifestation",
        "dice_size": "1d1",
        "table": {
          "1": "See below"
        }
      },
      {
        "subtable_name": "Corruption",
        "dice_size": "1d6",
        "table": {
          "1": "The caster’s left hand is transformed into a phantasm, becoming insubstantial and unable to grasp objects, although it appears real; the caster can no longer use two-handed weapons or otherwise manipulate objects with his left hand.",
          "2": "The caster becomes a matter-magnet, automatically granting “real” solidity to any illusion he touches.",
          "3": "Minor.",
          "4": "Minor.",
          "5": "Major.",
          "6": "Major."
        }
      },
      {
        "subtable_name": "Misfire",
        "dice_size": "1d4",
        "table": {
          "1": "The caster transforms one nearby ally into a phantasm, causing that ally’s image to “loop” on the same motions taken over the last few rounds, until the ally re-appears in 1d6+1 rounds with no memory of what has happened.",
          "2": "The caster creates a completely unbelievable phantasm, such as a translucent man or a very poorly animated scarecrow, which proceeds to follow him around for the rest of the day.",
          "3": "The caster summons into existence an extremely believable illusion of a deadly beast (such as a lion) which appears nearby and lunges at him before vanishing at the moment of impact, forcing a DC 10 Fort save or inflicting a -1 shock penalty to all rolls for the next 1d6 rounds.",
          "4": "The caster cannot control his illusions and generates a series of fantastic images related to faeries, gnomes, and unicorns, which frolic about him for the next 1d4 hours, drawing attention to him in almost all circumstances."
        }
      },
      {
        "subtable_name": "Spell Results",
        "dice_size": "1d20",
        "table": {
          "1": "Lost, failure, and worse.",
          "2-11": "Failure, but spell is not lost.",
          "12-13": "With full concentration for one round, the caster can create an image up to man-sized. The image must be something of which the caster has visual reference (such as a table resting nearby, or an adjacent ally) or has seen recently and studied carefully for at least one hour. The image springs into existence at a point indicated by the caster within 100’ and line of sight. It cannot move. It remains in place up to a maximum of 2 turns, as long as the caster concentrates. A creature with reason to disbelieve the illusion can make a Will save to see through it. Any creature that touches the illusion automatically discovers it is not real.",
          "14-15": "With full concentration for one round, the caster can create an image up to man-sized. The image must be something of which the caster has visual reference (such as a table resting nearby, or an adjacent ally) or has seen recently and studied carefully for at least one hour. The image springs into existence at a point indicated by the caster within 100’ and line of sight. The caster can cause the phantasm to move up to 5’ per round with concentration, though it is not animated. For example, he could cause a phantasmal lantern to bob in the air as if carried by a man, but if he made a phantasmal man carrying a lantern, the entire phantasm would simply shift in place by 5’ rather than appear to actually walk. The phantasm remains in place up to a maximum of 2 turns, as long as the caster concentrates. A creature with reason to disbelieve the illusion can make a Will save to see through it. Any creature that touches the illusion automatically discovers it is not real.",
          "16-19": "With full concentration for one round, the caster can create an image up to man-sized. The image must be something of which the caster has visual reference (such as a table resting nearby, or an adjacent ally) or has seen recently and studied carefully for at least one hour. The image springs into existence at a point indicated by the caster within 100’ and line of sight. The caster can cause the phantasm to move up to 30’ per round with concentration, and the phantasm will animate as if it is actually moving, provided the caster has visual reference or has carefully studied examples. For example, he could cause a phantasmal soldier to appear to actually walk. The phantasm remains in place up to a maximum of 1 hour, as long as the caster concentrates, and must remain within 100’ of the caster even while moving. If it moves beyond this range, it vanishes. A creature with reason to disbelieve the illusion can make a Will save to see through it. Any creature that touches the illusion automatically discovers it is not real.",
          "20-21": "With full concentration for one round, the caster can create an image up to giant-sized, which he can cause to “loop” on a predetermined visual track. The image must be something of which the caster has visual reference (such as a table resting nearby, or an adjacent ally) or has seen recently and studied carefully for at least one hour. The image springs into existence at a point indicated by the caster within 1,000’ and line of sight. The caster can cause the phantasm to move up to 30’ per round with concentration, and the phantasm will animate as if it is actually moving, provided the caster has visual reference or has carefully studied examples. For example, he could cause a phantasmal soldier to appear to actually walk. To create a repeating visual loop, the caster must concentrate to establish the initial path of movement and motions. Thereafter, if his concentration lapses, the phantasm repeats that movement track until the spell expires or until the caster initiates concentration again to change the track. The phantasm remains in place up to a maximum of 1 hour, “looping” whenever the caster’s concentration lapses. It must remain within 1,000’ of the caster, even while moving. If it moves beyond this range, it vanishes. A creature with reason to disbelieve the illusion can make a Will save to see through it. Any creature that touches the illusion automatically discovers it is not real.",
          "22-25": "With full concentration for one round, the caster can create an image up to giant-sized, which he can cause to “loop” on a predetermined visual track. The image must be something of which the caster has visual reference (such as a table resting nearby, or an adjacent ally) or has seen recently and studied carefully for at least one hour. The image springs into existence at a point indicated by the caster within 1,000’ and line of sight, but once created it can move beyond this range. The caster can cause the phantasm to move up to 60’ per round with concentration, and the phantasm will animate as if it is actually moving, provided the caster has visual reference or has carefully studied examples. For example, he could cause a phantasmal soldier to appear to actually walk. To create a repeating visual loop, the caster must concentrate to establish the initial path of movement and motions. Thereafter, if his concentration lapses, the phantasm repeats that movement track until the spell expires or until the caster initiates concentration again to change the track. The phantasm remains in place up to a maximum of 1 day, “looping” whenever the caster’s concentration lapses. It remains in existence even if the caster leaves the 1,000’ range, automatically “looping” when the caster is gone. A creature with reason to disbelieve the illusion can make a Will save to see through it. Any creature that touches the illusion automatically discovers it is not real.",
          "26-29": "With full concentration for one round, the caster can create an image of up to castle-sized, which he can cause to “loop” on a predetermined visual track. The image must be something of which the caster has visual reference (such as a table resting nearby, or an adjacent ally) or has seen recently and studied carefully for at least one hour. The image springs into existence at a point indicated by the caster within 1,000’ and line of sight, but once created it can move beyond this range. The caster can cause the phantasm to move up to 60’ per round with concentration, and the phantasm will animate as if it is actually moving, provided the caster has visual reference or has carefully studied examples. For example, he could cause a phantasmal soldier to appear to actually walk. To create a repeating visual loop, the caster must concentrate to establish the initial path of movement and motions. Thereafter, if his concentration lapses, the phantasm repeats that movement track until the spell expires or until the caster initiates concentration again to change the track. The phantasm remains in place up to a maximum of 1 day, “looping” whenever the caster’s concentration lapses. It remains in existence even if the caster leaves the 1,000’ range, automatically “looping” when the caster is gone. A creature with reason to disbelieve the illusion can make a Will save to see through it. Any creature that touches the illusion automatically discovers it is not real.",
          "30-31": "With full concentration for one round, the caster can create an image up to castle-sized, which he can cause to “loop” on a predetermined visual track. The image must be something of which the caster has visual reference (such as a table resting nearby, or an adjacent ally) or has seen recently and studied carefully for at least one hour. The image can be complex, such as a castle with knights marching along its ramparts. The image springs into existence at a point indicated by the caster within 1,000’ and line of sight, but once created it can move beyond this range. The caster can cause the phantasm to move up to 60’ per round with concentration, and the phantasm will animate as if it is actually moving, provided the caster has visual reference or has carefully studied examples. For example, he could cause a phantasmal soldier to appear to actually walk. To create a repeating visual loop, the caster must concentrate to establish the initial path of movement and motions. Thereafter, if his concentration lapses, the phantasm repeats that movement track until the spell expires or until the caster initiates concentration again to change the track. The phantasm remains in place up to a maximum of 1 week, “looping” whenever the caster’s concentration lapses. It remains in existence even if the caster leaves the 1,000’ range, automatically “looping” when the caster is gone. A creature with reason to disbelieve the illusion can make a Will save to see through it. Any creature that touches the illusion automatically discovers it is not real.",
          "32-33": "With full concentration for one round, the caster can create an image up to castle-sized, which he can cause to “loop” on a predetermined visual track. The image must be something of which the caster has visual reference (such as a table resting nearby, or an adjacent ally) or has seen recently and studied carefully for at least one hour. The image can be complex, such as a castle with knights marching along its ramparts. The image springs into existence at a point indicated by the caster within 1,000’ and line of sight, but once created it can move beyond this range. The caster can cause the phantasm to move up to 60’ per round with concentration, and the phantasm will animate as if it is actually moving, provided the caster has visual reference or has carefully studied examples. For example, he could cause a phantasmal soldier to appear to actually walk. To create a repeating visual loop, the caster must concentrate to establish the initial path of movement and motions. Thereafter, if his concentration lapses, the phantasm repeats that movement track until the spell expires or until the caster initiates concentration again to change the track. The phantasm remains in place up to a maximum of 1 month, “looping” whenever the caster’s concentration lapses. It remains in existence even if the caster leaves the 1,000’ range, automatically “looping” when the caster is gone. A creature with reason to disbelieve the illusion can make a Will save to see through it. Any creature that touches the illusion automatically discovers it is not real.",
          "34+": "With full concentration for one round, the caster can create any image he can imagine, of any size or complexity, and make it appear three-dimensional and real. The image can contain many complex motions. The caster need not have visual reference, and the strength of this spellcasting will “fill in the gaps” on images he imagines but has not seen, though sometimes such use of the spell creates inaccuracies in the details that may alert a viewer to the scene’s illusionary nature. The image springs into existence at a point indicated by the caster anywhere within line of sight, but once created it can move beyond this range. The caster can cause the phantasm to move up to 100’ per round, and the phantasm will animate as if it is actually moving. To create a repeating visual loop, the caster must concentrate to establish the initial path of movement and motions. Thereafter, if his concentration lapses, the phantasm repeats that movement track until the spell expires or until the caster initiates concentration again to change the track. The phantasm remains in place up to a maximum of 1 year, “looping” whenever the caster’s concentration lapses. It remains in existence even if the caster leaves the scene of creation, automatically “looping” when the caster is gone. A creature with reason to disbelieve the illusion can make a Will save to see through it. Any creature that touches the illusion automatically discovers it is not real."
        }
      }
    ]
  }
  