{
    "table_name": "phylactery-of-the-soul",
    "notes": "Level: 3 (Sezrekan) -- Range: Self -- Duration: Variable -- Casting time: 1 day -- Save: See below",
    "general": "The caster places his soul into a gem or amulet (worth at least 1d8 × 100 gp), creating a phylactery while maintaining control of his mortal body. If the body is slain, the caster's awareness shifts to the phylactery, and he must inhabit a new body within the time determined by the spell result. A new body must touch the phylactery, and a Will save is required to resist possession. The caster has no awareness of the phylactery’s surroundings while in a body.",
    "sub_tables": [
      {
        "subtable_name": "Manifestation",
        "dice_size": "1d3",
        "table": {
          "1": "The caster's body takes on a pallid air, and his eyes glaze over as his soul enters the phylactery.",
          "2": "A crack resounds in the heavens, and the air smells of copper and burnt offerings.",
          "3": "The caster crumples to his knees, howling in spiritual agony as his soul is torn from his mortal shell."
        }
      },
      {
        "subtable_name": "Spell Results",
        "dice_size": "1d20",
        "table": {
          "1": "Lost, failure, and patron taint.",
          "2-11": "Lost. Failure.",
          "12-15": "Failure, but spell is not lost.",
          "16-17": "The caster places his soul within the phylactery. His body cannot travel more than 10 miles from it; exceeding this distance causes his body to die. The caster has 1d6 + CL hours to inhabit a new body before his soul dissipates.",
          "18-21": "The caster places his soul within the phylactery. His body cannot travel more than 50 miles from it; exceeding this distance causes his body to die. The caster has 1d10 + CL days to inhabit a new body before his soul dissipates.",
          "22-23": "The caster places his soul within the phylactery. His body cannot travel more than 100 miles from it; exceeding this distance causes his body to die. The caster has 1d16 + CL days to inhabit a new body before his soul dissipates.",
          "24-26": "The caster places his soul within the phylactery. His body cannot travel more than 500 miles from it; exceeding this distance causes his body to die. The caster has 1d20 + CL days to inhabit a new body before his soul dissipates.",
          "27-31": "The caster places his soul within the phylactery. His body cannot travel more than 1,000 miles from it; exceeding this distance causes his body to die. The caster has 1d6 + CL weeks to inhabit a new body before his soul dissipates.",
          "32-33": "The caster places his soul within the phylactery. His body can travel anywhere on this plane. Extraplanar travel causes his body to die. The caster has 1d10 + CL weeks to inhabit a new body before his soul dissipates.",
          "34-35": "The caster places his soul within the phylactery. His body can travel anywhere in the multiverse without restrictions. If slain, the caster has 1d16 + CL weeks to inhabit a new body before his soul dissipates.",
          "36+": "The caster places his soul within the phylactery. His body can travel anywhere in the multiverse without danger. If slain, the caster has 1d100 + CL years to inhabit a new body before his soul dissipates."
        }
      }
    ]
  }
  