{
    "table_name": "sanctify-desecrate",
    "notes": "Level: 4 -- Range: 20’ square area per CL -- Duration: Varies -- Casting time: 1 turn -- Save: See below",
    "general": "The cleric dedicates a physical space to his deity, granting it supernatural protection and attuning it to the will and agenda of his divine master. This sanctum becomes a refuge for the cleric and other worshippers of the deity. The spell can also be cast upon a space already sacrosanct to another deity. If the cleric’s spell check is greater than that of the cleric who originally sanctified the space, the area becomes desecrated and no longer grants any benefits to those within. A space that has been desecrated must be cleansed of any lingering traces of its former divine connection (a month-long process) before it can be sanctified to a new deity. No cleansing is necessary to re-sanctify a space to its former divine protector. The cleric, worshippers of the cleric’s deity, and those of the same alignment of the cleric gain the full benefit of the sanctuary as determined by the spell check. Those of a different alignment who worship a deity not in direct opposition to the cleric’s deity gain half the normal benefits of the sanctuary (rounded up), i.e. a cleric of a different, but not antagonistic, god would receive a +1 bonus to laying on hands if the cleric who cast the sanctify/desecrate spell scored a 20 on her spell check. Individuals who are unholy (according to the cleric’s faith) or worship a deity opposed to the casting cleric’s own suffer a negative penalty equal the bonus the sanctuary provides true believers and may be subject to physical damage as well. Each sanctuary provides a bonus to spell checks, turning, laying on hands, and pleas for divine aid. In addition, the sanctuary provides a bonus to actions related to the deity to which it is dedicated. The judge must adjudicate these bonuses on a deity-by-deity basis, but they should always apply to actions favorable to the deity. For example, a sanctuary dedicated to Klazath, god of war, would modify all combat rolls made by the cleric and his followers while within the sacred space. The devotees of Amun Tor, god of mysteries and riddles, would gain the sanctuary’s bonus to rolls made to decipher codes or uncover hidden clues; while those of Bobugbubilz, demon lord of evil amphibians, would discover that all batrachian servants or summoned creatures within the sanctuary add the bonus to their hit points, saving throws, and attack rolls.",
    "sub_tables": [
      {
        "subtable_name": "Manifestation",
        "dice_size": "1d4",
        "table": {
          "1": "The affected area erupts in harmless, divine fire that leaves the sanctum magically cleansed.",
          "2": "The affected area glows with a divine radiance of a color appropriate to the cleric’s deity.",
          "3": "A blast of celestial music spills from the cleric’s mouth, causing the affected area to resonate with the music of the spheres.",
          "4": "Tears of holy/unholy water flow from the cleric’s eyes, anointing the affected area."
        }
      },
      {
        "subtable_name": "Spell Results",
        "dice_size": "1d20",
        "table": {
          "1-17": "Failure.",
          "18-19": "The cleric creates a minor sanctuary. All spell checks, turning, laying on of hands, pleas for divine aid, and actions related to the sanctuary’s deity receive a +1 bonus. The area remains a sanctuary for 3 hours.",
          "20-23": "The cleric creates a lesser sanctuary. All spell checks, turning, laying on of hands, pleas for divine aid, and actions related to the sanctuary’s deity receive a +2 bonus. Unholy creatures with 1 HD or less must make a Fort save when entering the area or suffer 1d3 points of damage. The area remains a sanctuary for 6 hours.",
          "24-25": "The cleric creates a moderate sanctuary. All spell checks, turning, laying on of hands, pleas for divine aid, and actions related to the sanctuary’s deity receive a +3 bonus. Unholy creatures with 2 HD or less must make a Fort save when entering the area or suffer 1d5 points of damage. Spells targeted at the cleric and allied individuals of the cleric’s faith inside the sanctuary suffer a -1 penalty to spell checks. The area remains a sanctuary for 12 hours.",
          "26-27": "The cleric creates a greater sanctuary. All spell checks, turning, laying on of hands, pleas for divine aid, and actions related to the sanctuary’s deity receive a +4 bonus. Unholy creatures with 3 HD or less must make a Fort save when entering the area or suffer 1d6 points of damage. Spells targeted at the cleric and allied individuals of the cleric’s faith inside the sanctuary suffer a -2 penalty to spell checks. The area remains a sanctuary for 1 day.",
          "28-33": "The cleric creates a major sanctuary. All spell checks, turning, laying on of hands, pleas for divine aid, and actions related to the sanctuary’s deity receive a +5 bonus. Unholy creatures with 4 HD or less must make a Fort save when entering the area or suffer 1d8 points of damage. Spells targeted at the cleric and allied individuals of the cleric’s faith inside the sanctuary suffer a -4 penalty to spell checks. The area remains a sanctuary for 1 week.",
          "34-35": "The cleric creates a true sanctuary. All spell checks, turning, laying on of hands, pleas for divine aid, and actions related to the sanctuary’s deity receive a +6 bonus. Unholy creatures with 5 HD or less must make a Fort save when entering the area or suffer 1d10 points of damage plus an additional 1 point of damage each round thereafter (Fort save to resist). Spells targeted at the cleric and allied individuals of the cleric’s faith inside the sanctuary suffer a -4 penalty to spell checks. The area remains a sanctuary for 1 month.",
          "36-37": "The cleric creates a divine sanctuary. All spell checks, turning, laying on of hands, pleas for divine aid, and actions related to the sanctuary’s deity receive a +7 bonus. Unholy creatures with 6 HD or less must make a Fort save when entering the area or suffer 1d20 points of damage plus an additional 2 points of damage each round thereafter (Fort save to resist). Spells targeted at the cleric and allied individuals of the cleric’s faith inside the sanctuary suffer a -5 penalty to spell checks. The area permanently remains a sanctuary until desecrated.",
          "38+": "The cleric creates a place forever revered by those of his faith. All spell checks, turning, laying on of hands, pleas for divine aid, and actions related to the sanctuary’s deity receive a +10 bonus. Unholy creatures with 8 HD or less must make a Fort save when entering the area or suffer 2d20 points of damage plus an additional 4 points of damage each round thereafter (Fort save to resist). Spells targeted at the cleric and allied individuals of the cleric’s faith inside the sanctuary suffer a -10 penalty to spell checks. The area permanently remains a sanctuary until physically destroyed, desecrated, and the ground itself is salted or doused with cursed waters and oils."
        }
      }
    ]
  }
  