{
    "table_name": "shatter",
    "notes": "Level: 2 Range: Touch or further -- Duration: Instantaneous or longer -- Casting time: 1 round -- Save: N/A",
    "general": "The caster shatters a physical object. This spell causes damage to inanimate objects and is particularly effective at objects made of crystal or glass. It has the potential to not only damage the object immediately but also cause ongoing fractures that make it more susceptible to future damage.",
    "sub_tables": [
      {
        "subtable_name": "Manifestation",
        "dice_size": "1d4",
        "table": {
          "1": "object simply shatters",
          "2": "blast as if an explosion",
          "3": "flash of light",
          "4": "bolt of lightning from the sky strikes the object"
        }
      },
      {
        "subtable_name": "Corruption",
        "dice_size": "1d6",
        "table": {
          "1": "minor",
          "2": "minor",
          "3": "minor",
          "4": "major",
          "5": "major",
          "6": "greater"
        }
      },
      {
        "subtable_name": "Misfire",
        "dice_size": "1d5",
        "table": {
          "1": "one randomly determined object on the caster’s person shatters",
          "2": "randomly determine one ally within 20’ (or caster if no nearby ally) and all mundane possessions of that ally have risk of shattering, as follows: magical objects have 10% chance, metal and stone objects have 25% chance, wooden and crystal/gemlike objects have 50% chance, cloth and all other soft objects have 75% chance of crumbling apart",
          "3": "instead of shattering targeted object, spell infuses it with greater strength of construction, rendering it automatically resistant to the next shatter spell cast against it, but resistance wears off after one use",
          "4": "all non-magical weapons in the hands of creatures (both allies and enemies) within 25’ shatter",
          "5": "all armor within 25’ (including shields and helms) comes apart and loses armor bonus"
        }
      },
      {
        "subtable_name": "Spell Results",
        "dice_size": "1d20",
        "table": {
          "1": "Lost, failure, and worse! Roll 1d6 modified by Luck: (0 or less) corruption + patron taint + misfire; (1) corruption; (2) patron taint (or corruption if no patron); (3+) misfire",
          "2-11": "Lost. Failure.",
          "12-13": "Failure, but spell is not lost.",
          "14-15": "By touching a mundane (non-magical) inanimate object made of wood, metal, crystal, glass, stone, or another similar substance, the caster creates a fracture at the point of contact. This automatically inflicts 1d4 points of damage to the object, bypassing any normal resistance to damage. Typically, a dagger has 1-4 hit points, a sword has 4-6 hit points, and larger objects have progressively more hit points, depending on their construction (glass is weakest, wood is stronger, stone is even stronger, metal is strongest). This effect is typically enough to break a doorknob or hinge, shatter a glass window, snap a dagger blade from its hilt, or crack a mirror, but not enough to burst down a door. Using this spell in combat is dangerous, as the caster is exposed to attack when he attempts to touch the target object; opponents receive a free strike if the caster tries to touch them with this spell, and the caster must also succeed in an attack roll to make contact.",
          "16-19": "By touching a mundane (non-magical) inanimate object made of wood, metal, crystal, glass, stone, or another similar substance, the caster creates a fracture at the point of contact. This automatically inflicts 3d4 points of damage to the object and an additional +2 points of damage if the object is glass or crystal or a gemstone, bypassing any normal resistance to damage. Typically, a dagger has 1-4 hit points, a sword has 4-6 hit points, and larger objects have progressively more hit points, depending on their construction (glass is weakest, wood is stronger, stone is even stronger, metal is strongest). This spell result is usually enough to shatter a sword, shield, or helm, break a wagon wheel, explode a mirror, or shatter a valuable gem (but not a diamond). Using this spell in combat is dangerous, as the caster is exposed to attack when he attempts to touch the target object; opponents receive a free strike if the caster tries to touch them with this spell, and the caster must also succeed in an attack roll to make contact.",
          "20-21": "By touching a mundane (non-magical) inanimate object made of wood, metal, crystal, glass, stone, or another similar substance, the caster creates a fracture at the point of contact. This automatically inflicts 3d6+CL damage to the object and an additional +4 points of damage if the object is glass or crystal or a gemstone, bypassing any normal resistance to damage. Typically, a dagger has 1-4 hit points, a sword has 4-6 hit points, and larger objects have progressively more hit points, depending on their construction (glass is weakest, wood is stronger, stone is even stronger, metal is strongest). This spell result is usually enough to break down a door, crack a suit of plate mail, burst an ironbound chest in half, break a wagon in half, or shatter a diamond. Using this spell in combat is dangerous, as the caster is exposed to attack when he attempts to touch the target object; opponents receive a free strike if the caster tries to touch them with this spell, and the caster must also succeed in an attack roll to make contact.",
          "22-25": "By touching an inanimate object made of wood, metal, crystal, glass, stone, or another similar substance, the caster creates a fracture at the point of contact. This automatically inflicts 4d6+CL damage to mundane objects or 1d6 points of damage to magical objects (such as magic weapons). It inflicts an additional +4 points of damage if the object is glass or crystal or a gemstone, bypassing any normal resistance to damage. Typically, a dagger has 1-4 hit points, a sword has 4-6 hit points, and larger objects have progressively more hit points, depending on their construction (glass is weakest, wood is stronger, stone is even stronger, metal is strongest). This spell result is usually enough to break down a door, crack a suit of plate mail, burst an ironbound chest in half, break a wagon in half, or shatter a diamond. Using this spell in combat is dangerous, as the caster is exposed to attack when he attempts to touch the target object; opponents receive a free strike if the caster tries to touch them with this spell, and the caster must also succeed in an attack roll to make contact.",
          "26-29": "By touching an inanimate object made of wood, metal, crystal, glass, stone, or another similar substance, the caster creates a fracture at the point of contact. Alternatively, the caster can imbue the power of this spell on a single object (such as an arrow or dagger point). The spell is triggered when the object strikes something within the next round; after 1 round, the power dissipates. This allows the caster to enchant an arrow that can then be used to shatter an enemy’s armor (for example). The spell automatically inflicts 4d8+CL damage to mundane objects or 2d6 points of damage to magical objects (such as magic weapons). It inflicts an additional +4 points of damage if the object is glass or crystal or a gemstone, bypassing any normal resistance to damage. Typically, a dagger has 1-4 hit points, a sword has 4-6 hit points, and larger objects have progressively more hit points, depending on their construction (glass is weakest, wood is stronger, stone is even stronger, metal is strongest). This spell result is usually enough to break down a door, crack a suit of plate mail, burst an ironbound chest in half, break a wagon in half, or shatter a diamond. Using this spell in combat is dangerous, as the caster is exposed to attack when he attempts to touch the target object; opponents receive a free strike if the caster tries to touch them with this spell, and the caster must also succeed in an attack roll to make contact.",
          "30-31": "By touching an inanimate object made of wood, metal, crystal, glass, stone, or another similar substance, the caster creates a fracture at the point of contact. Alternatively, the caster can imbue the power of this spell on a single object (such as an arrow or dagger point). The spell is triggered when the object strikes something within the next turn. This allows the caster to enchant an arrow that can then be used to shatter an enemy’s armor (for example). The spell automatically inflicts 4d8+CL damage to mundane objects or 2d6 points of damage to magical objects (such as magic weapons). It inflicts an additional +4 points of damage if the object is glass or crystal or a gemstone, bypassing any normal resistance to damage. Typically, a dagger has 1-4 hit points, a sword has 4-6 hit points, and larger objects have progressively more hit points, depending on their construction (glass is weakest, wood is stronger, stone is even stronger, metal is strongest). This spell result is usually enough to break down a door, crack a suit of plate mail, burst an ironbound chest in half, break a wagon in half, or shatter a diamond. Using this spell in combat is dangerous, as the caster is exposed to attack when he attempts to touch the target object; opponents receive a free strike if the caster tries to touch them with this spell, and the caster must also succeed in an attack roll to make contact.",
          "32-33": "Within a range of 60’, the caster can target an inanimate object made of wood, metal, crystal, glass, stone, or another similar substance, to create a fracture at the point of contact. Alternatively, the caster can imbue the power of this spell on a single object (such as an arrow or dagger point). The spell is triggered when that object strikes something within the next turn. This allows the caster to enchant an arrow that can then be used to shatter an enemy’s armor (for example). The spell automatically inflicts 4d8+CL damage to mundane objects or 3d6+CL damage to magical objects (such as magic weapons). It inflicts an additional +4 points of damage if the object is glass or crystal or a gemstone, bypassing any normal resistance to damage. Typically, a dagger has 1-4 hit points, a sword has 4-6 hit points, and larger objects have progressively more hit points, depending on their construction (glass is weakest, wood is stronger, stone is even stronger, metal is strongest). This spell result is usually enough to break down a door, crack a suit of plate mail, burst an ironbound chest in half, break a wagon in half, or shatter a diamond.",
          "34+": "Within a range of 1,000’, the caster can target an inanimate object made of wood, metal, crystal, glass, stone, or another similar substance, to create a fracture at the point of contact. At this level of casting, the caster can also target golems, automatons, living statues, and other animated but non-sentient creatures, which count as magical objects for purposes of the spell. Alternatively, the caster can imbue the power of this spell on a single object (such as an arrow or dagger point). The spell power remains on the object permanently, and the spell is triggered when that object strikes something. This allows the caster to enchant an arrow that can then be used to shatter an enemy’s armor (for example). The spell automatically inflicts 6d8+CL damage to mundane objects or 4d6+CL damage to magical objects (such as magic weapons). It inflicts an additional +6 points of damage if the object is glass or crystal or a gemstone, bypassing any normal resistance to damage. Typically, a dagger has 1-4 hit points, a sword has 4-6 hit points, and larger objects have progressively more hit points, depending on their construction (glass is weakest, wood is stronger, stone is even stronger, metal is strongest). This spell result is usually enough to break down a door, crack a suit of plate mail, burst an ironbound chest in half, break a wagon in half, or shatter a diamond."
        }
      }
    ]
  }
  