{
    "table_name": "snake-trick",
    "notes": "Level: 1 (Azi Dahaka) -- Range: Varies -- Duration: Varies -- Casting time: 1 round -- Save: Will vs. check if the item is held by an unwilling creature; magic items always receive a Will save",
    "general": "As a servant of Azi Dahaka, the caster is a friend to the common asp and lowly serpent. With a word, the caster transforms any non-living object into a writhing serpent. The serpent is not under the caster’s control and does its best to defend itself, slithering away or striking, as appropriate. The target object must be roughly longer than it is wide. For example, a crown could be transformed into a snake but a wooden crate could not.",
    "sub_tables": [
      {
        "subtable_name": "Manifestation",
        "dice_size": "1d4",
        "table": {
          "1": "Caster’s fingers become writhing snakes.",
          "2": "Caster is shrouded in a black halo of snake-like forms.",
          "3": "The hissing of a thousand snakes fills the air.",
          "4": "Caster’s eyes flash with the steely gaze of the serpent."
        }
      },
      {
        "subtable_name": "Spell Results",
        "dice_size": "1d20",
        "table": {
          "1": "Lost, failure, and patron taint.",
          "2-11": "Lost. Failure.",
          "12-13": "The caster transforms a non-magical object, up to the volume of a dagger, permanently into a snake of like size. The object must be within 15’. If in the hand of an enemy, the snake immediately strikes (Atk +1, dmg 1 plus poison (Fort DC 12 or 1 Str)) before slithering away.",
          "14-17": "The caster transforms a non-magical object, up to the volume of a longsword, permanently into a snake of like size. The object must be within 25’. If in the hand of an enemy, the snake immediately strikes (Atk +3, dmg 1d3 plus poison (Fort DC 15 or 1d4 Str)) before slithering away.",
          "18-19": "The caster transforms a non-magical object, up to the volume of a spear, permanently into a snake of like size. The object must be within 50’. If in the hand of an enemy, the snake immediately strikes (Atk +5, dmg 1d4+1 plus poison (Fort DC 18 or 1d6 Str)) before slithering away.",
          "20-23": "The caster transforms 1d3 non-magical objects, each up to the volume of a spear, permanently into snakes of like size. The objects must be within 100’. If in the hands of enemies, the snakes immediately strike (Atk +5, dmg 1d4+1 plus poison (Fort DC 18 or 1d6 Str)) before slithering away.",
          "24-27": "The caster transforms 1d12 non-magical non-living objects, or one magical object, each up to the volume of a spear, permanently into snakes of like size. The objects must be within sight. If in the hands of enemies, the snakes immediately strike (Atk +5, dmg 1d4+1 plus poison (Fort DC 18 or 1d6 Str)) before slithering away.",
          "28-29": "The caster transforms 1d24 non-magical objects, or one magical object, each up to the volume of a spear, permanently into snakes of like size. The objects must be within sight. If in the hands of enemies, the snakes immediately strike (Atk +5, dmg 1d4+1 plus poison (Fort DC 18 or 1d6 Str)) before slithering away.",
          "30-31": "The caster transforms 1d100 objects, or 1d4 magical objects, each up to the volume of a spear, permanently into snakes of like size. The objects must be within sight. If in the hands of enemies, the snakes immediately strike (Atk +5, dmg 1d4+1 plus poison (Fort DC 18 or 1d6 Str)) before slithering away.",
          "32+": "The caster transforms 3d100 objects, or 2d6 magical objects, each up to the volume of a spear, permanently into snakes of like size. The objects must be within sight. If in the hands of enemies, the snakes immediately strike (Atk +5, dmg 1d4+1 plus poison (Fort DC 18 or 1d6 Str)) before slithering away. Alternately, the caster can transform a single non-living man-made object of any size (a tower, a ship, a lighthouse, an inn) into a snake of like size. Generally this massive creature will have at least 10 HD and an attack at +20 for damage of 2d12, with a powerful poison (Fort DC 24 or 2d6 Str)."
        }
      }
    ]
  }
  