{
    "table_name": "stinging-stone",
    "notes": "Level: 2 -- Range: Objects touched -- Duration: See below -- Casting time: 1 turn -- Save: Fort vs. spell check DC",
    "general": "The cleric transforms an object into a poisonous creature. For example, the cleric can change a sling stone into a spider, an arrow to an asp, or a staff into a serpent. The specifics are as follows: • At low levels of effect (see below), the cleric can transform a small object into a poisonous spider. The object can be a coin, gem, sling stone, apple, beer mug, or other such small thing. The spell descriptions below assume a sling stone is used. For the spell’s duration, the object retains its natural shape until it touches an enemy. So, for example, the cleric can hide a gemstone in a chest, which transforms into a spider when grasped; or launch an attack with his sling, and the stone transforms into a spider or scorpion when it strikes the enemy. Once the object touches an enemy (either through their grasp or via a successful hit as with a sling stone), it transforms into a spider, which remains for a certain amount of time. The spider receives one bite immediately on the round of attack and one additional bite each round until the spell ends. (A missed sling stone does not transform.) It reverts to its natural shape at the end of the spell. The poisonous spider is AC 14 (due to small size and agility) and has only 1 hp, but immediately scurries toward exposed flesh and strikes the enemy. On the first bite, the spider’s attack automatically hits, causing damage 1 + poison. The target must make a Fort save against the spell check DC or suffer poison as per a (roll 1d3) (1) black widow; (2) tarantula; or (3) scorpion (see Appendix P). On future rounds the spider must make an attack roll at Atk +2 in order to inflict damage. Note that the spider continues to scurry about and bite for the duration of the spell. Strikes against it that miss have a 50% chance of hitting the spell’s target for damage. • At medium levels of effect (see below), the cleric can transform an arrow into an asp or adder. (He could also transform other similarly shaped objects into an asp or adder: a stick of wood, a lever, a metal rod, etc.) As above, the object retains its natural shape until it touches an enemy, at which point it transforms. The asp or adder receives one bite immediately on the round of attack and one additional bite each round until the spell ends. The first bite automatically hits, causing damage 2 + poison. The target must make a Fort save against the spell check DC or suffer the poison of an asp or adder (see Appendix P). On future rounds the snake must make an attack roll at Atk +4 in order to inflict damage. Note that the snake continues to slither about and bite for the duration of the spell. Strikes against it that miss have a 50% chance of hitting the spell’s target for damage. • At the highest levels of effect (see below), the cleric can transform a staff into a cobra or viper. (He could also transform other similarly shaped objects into a cobra: a tree branch, a pole arm, etc.) In this case, each time the cleric strikes with the staff, it transforms into a serpent, bites, and then transforms back into a staff. The serpent-staff is treated as a +4 magical weapon, so it attacks at the cleric’s normal attack bonus with an additional +4 modifier. Any successful attack causes normal weapon damage, +4 for the magical modifier, and inflicts poison as per a cobra or viper strike (see Appendix P). The Fort save against the poison is the spell check result. If the cleric strikes with the staff and then releases it, the staff remains in serpent form and continues to attack with its bite for the duration of the spell; in this case, it attacks at Atk +6 and inflicts damage of 1d4+4 plus poison. In all cases, the transformed spider or serpent is wild and uncontrolled. It will not obey commands from the cleric. An arrow that transforms into an asp, for example, cannot be commanded to return to the cleric after killing its target. It will simply slither off like any wild snake.",
    "sub_tables": [
      {
        "subtable_name": "Manifestation",
        "dice_size": "1d4",
        "table": {
          "1": "The object does not change in appearance but transforms at a touch.",
          "2": "The object retains its natural shape until it touches an enemy, then transforms into a spider.",
          "3": "The object remains as it is until it touches an enemy, at which point it turns into a serpent.",
          "4": "The object changes at a distance, hovering in the air until it touches its target."
        }
      },
      {
        "subtable_name": "Spell Results",
        "dice_size": "1d20",
        "table": {
          "1-13": "Failure.",
          "14-15": "The cleric can transform a single small object, up to the size of a sling stone, into a poisonous spider. For a duration of 1d4+CL turns, the object retains its natural shape until it touches an enemy. Once it touches an enemy, it remains in spider form for 2 rounds.",
          "16-19": "The cleric can transform a single small object, up to the size of a sling stone, into a poisonous spider. For a duration of 1d4+CL days, the object retains its natural shape until it touches an enemy. Once it touches an enemy, it remains in spider form for 1d4+CL rounds.",
          "20-21": "The cleric can transform up to 5 small objects, up to the size of sling stones, into poisonous spiders. Or he can transform a single arrow into an asp or adder. For a duration of 1d4+CL days, the objects retain their natural shapes until they touch an enemy. Once an object touches an enemy, it remains in spider or snake form for 1d4+CL rounds.",
          "22-25": "The cleric can transform up to 10 small objects, up to the size of sling stones, into poisonous spiders. Or he can transform up to three arrows into asps or adders. For a duration of 1d4+CL days, the objects retain their natural shapes until they touch an enemy. Once an object touches an enemy, it remains in spider or snake form for 1d4+CL rounds.",
          "26-29": "The cleric can transform up to 25 sling stones into poisonous spiders, up to 10 arrows into asps or adders, or a single staff into a cobra or viper. For a duration of 1d4+CL days, the objects retain their natural shape until they touch an enemy. Once they touch an enemy, they remain in spider or snake form for 1d6+CL rounds.",
          "30-31": "The cleric can transform up to 25 sling stones into poisonous spiders, up to 10 arrows into asps or adders, or a single staff into a cobra or viper. For a duration of 1d4+CL weeks, the objects retain their natural shape until they touch an enemy. Once they touch an enemy, they remain in spider or snake form for 2d6+CL rounds.",
          "32-33": "The cleric can transform up to 50 sling stones into poisonous spiders, up to 20 arrows into asps or adders, or up to two staves into cobras or vipers. For a duration of 1d4+CL weeks, the objects retain their natural shape until they touch an enemy. Once they touch an enemy, they remain in spider or snake form for 3d6+CL rounds.",
          "34+": "The cleric can transform up to 100 sling stones into poisonous spiders, up to 40 arrows into asps or adders, or up to four staves into cobras or vipers. For a duration of 1d8+CL weeks, the objects retain their natural shape until they touch an enemy. Once they touch an enemy, they remain in spider or snake form for 3d6+CL rounds. Alternatively, the cleric can transform a single object permanently. Specify a single sling stone, arrow, or staff. It is permanently subject to transformation, as noted above. When it changes form into a spider or serpent, it stays in that form for the normal duration of 3d6+CL rounds, then reverts to its natural state until triggered again. If the “object” is killed while in serpent or spider form, it remains in its dead state and its magical properties are lost."
        }
      }
    ]
  }
  