{
    "table_name": "strength",
    "notes": "Level: 2 -- Range: Varies -- Duration: Varies -- Casting time: 1 action -- Save: N/A",
    "general": "With an arcane incantation, the caster grants physical strength to a willing target.",
    "sub_tables": [
      {
        "subtable_name": "Manifestation",
        "dice_size": "1d4",
        "table": {
          "1": "biceps and muscles physically enlarge, potentially bursting clothing",
          "2": "muscles glow with infernal light",
          "3": "fierce aura surrounds target",
          "4": "no change"
        }
      },
      {
        "subtable_name": "Corruption",
        "dice_size": "1d8",
        "table": {
          "1": "caster’s muscles wither and age, permanently reducing his Strength by 1 point",
          "2": "caster has great difficulty summoning any kind of supernatural strength, such that from now on all spellburn of Strength requires 2 points of spellburn for every +1 to a spell check",
          "3": "caster permanently gains +1d4 points of Strength but at the cost of the same number of points of Intelligence",
          "4": "caster’s muscles bulge disproportionately and chaotically, giving him a lopsided, hunchbacked appearance",
          "5-6": "minor",
          "7": "major",
          "8": "greater"
        }
      },
      {
        "subtable_name": "Misfire",
        "dice_size": "1d4",
        "table": {
          "1": "caster inadvertently weakens himself, losing 1d4+1 points of Strength temporarily",
          "2": "caster saps the strength of those around him, reducing the Strength of everyone within 20’ (allies and enemies alike) by 1d4+1 points",
          "3": "caster channels his allies’ strength of will to his enemies’ strength, such that the highest allied Willpower save within 20’ becomes the total Strength modifier of all enemies within the same range",
          "4": "caster drops to the ground with the strength of an infant, completely unable to move (Str 0), and all of his Strength points flow to the nearest ally of his choice, whose Strength suddenly increases by the amount of the caster’s decrease, with the lost Strength returning from target to caster at the end of 1d4 turns"
        }
      },
      {
        "subtable_name": "Spell Results",
        "dice_size": "1d20",
        "table": {
          "1": "Lost, failure, and worse! Roll 1d6 modified by Luck: (0 or less) corruption + patron taint + misfire; (1-2) corruption; (3) patron taint (or corruption if no patron); (4+) misfire",
          "2-11": "Lost. Failure.",
          "12-13": "Failure, but spell is not lost.",
          "14-15": "One target the caster touches (including himself) is enhanced to a prodigious Strength of 18 (+3 bonus), which lasts for 1d6+1 rounds.",
          "16-19": "One target the caster touches briefly gains superhuman strength. The target is treated as having a Strength modifier of +10 until the end of the next round. The superhuman Strength immediately fades after the end of that round.",
          "20-21": "One target the caster touches gains Strength 20 (+4 bonus), which lasts for 1d6 turns.",
          "22-25": "A single target touched receives Strength 20 (+4 bonus) or two targets each receive Strength 18 (+3 bonus). The bonus lasts for 1d6 turns.",
          "26-29": "All allies within 20’ of the caster gain Strength 18 (+3 bonus) for next 1d6 turns.",
          "30-31": "All allies within 20’ of the caster take their next activation as if they had a +10 Strength modifier. Additionally, they gain Strength 18 (+3 bonus) for the next 1d6 hours thereafter.",
          "32-33": "All allies with 100’ of the caster receive Strength 20 (+4 bonus) for the next 1d4 days.",
          "34+": "If caster completes a week-long ritual casting with a minimum of 10 points of spellburn, and both target and caster render appropriate sacrifices of great value, the target receives a one-time permanent bonus of +1 Strength. However, the target must make a Fortitude save or find his body unable to sustain the magical transformation. The save DC is equal to 15 + 2 for every point of Strength that has been magically added; i.e., the first save is DC 17, then if this spell is attempted again the save is DC 19, and so on. If the save is failed, the increased Strength fades after 1d6 weeks, and the caster finds that 1 point of his spellburn never truly heals (judge’s discretion which ability is affected)."
        }
      }
    ]
  }
  