{
    "table_name": "the-dreaming",
    "notes": "Level: 3 (The King of Elfland) -- Range: Self -- Duration: Varies -- Casting time: 1 round -- Save: None",
    "general": "The caster invokes the ancient, slumbering magic of the Elflands, slowing or stopping time itself as the dreaming of twilight spills into the mortal realm.",
    "sub_tables": [
      {
        "subtable_name": "Manifestation",
        "dice_size": "1d3",
        "table": {
          "1": "Glowing mist settles over the area.",
          "2": "Scintillating dust and the peal of tinkling bells fill the air.",
          "3": "A strange air settles over the caster, as if lit by the fading light of dusk."
        }
      },
      {
        "subtable_name": "Spell Results",
        "dice_size": "1d20",
        "table": {
          "1": "Lost, failure and patron taint.",
          "2-11": "Lost. Failure.",
          "12-15": "Failure, but spell is not lost.",
          "16-17": "The dreaming magic of the faerie-realms spills into the world around the caster, slowing the passage of time. Versed in the ways of the Elflands, the caster may take an extra action each round and is granted a +1 bonus to his AC, Reflex saves, and attack rolls. The extra action is at the caster’s lowest action die. The enchantment lasts for 1d4 rounds.",
          "18-21": "The caster’s mastery of the Elflands is like an aura, protecting his allies from the fey and fell magics. The caster and all his allies within 50’ may take an extra action each round (at each character’s lowest action die) and are granted a +1 bonus to AC, Reflex saves, and attack rolls. The enchantment lasts for 1d4 rounds.",
          "22-23": "Time slows to a crawl. The caster and all his allies within 50’ may take two extra actions each round (at each character’s lowest action die) and are granted a +2 bonus to AC, Reflex saves, and attack rolls. The enchantment lasts for 1d3 rounds.",
          "24-26": "The caster and all his allies within 50’ may take three extra actions each round (at each character’s lowest action die) and are granted a +3 bonus to AC, Reflex saves, and attack rolls. The enchantment lasts for 1d3 rounds.",
          "27-31": "The caster and all his allies within 50’ may take three extra actions each round (at each character’s lowest action die) and are granted a +3 bonus to AC, Reflex saves, and attack rolls. The enchantment lasts for 1d3 rounds, and may be extended with spellburn. When the spell is about to expire, the caster may spellburn 1 point of attribute to extend the spell’s effect by 1 round. He may continue to extend the spell’s effect, round by round, in this manner. Using such spellburn requires an action on the caster’s part (which can be one of several actions provided he extends the spell).",
          "32-33": "The passage of time stops for 1d3+CL rounds. The caster is the sole mortal immune to the effects of the enchantment, though gods and other immortals may also be immune. During this time, the caster may take normal activations, while other creatures are frozen in time. This can allow the caster to cast multiple spells, make multiple attacks, flee, or otherwise do whatever he wishes with no chance for others to react.",
          "34-35": "Time stops, resuming only when the caster or the King of Elfland dismiss the enchantment. The caster is the sole mortal immune to the effects of the enchantment, though gods and other immortals may also be immune. During this time, the caster may take normal activations, while other creatures are frozen in time. This can allow the caster to cast multiple spells, make multiple attacks, flee, or otherwise do whatever he wishes with no chance for others to react.",
          "36+": "Time stops, as result 34-35 above. Additionally, the caster may turn back time by permanently spellburning attribute points at the rate of 2 points for every 10 minutes."
        }
      }
    ]
  }
  